#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 011cdaae9e04bd7f9972250be7b53ee5.pdb
; shader hash: 011cdaae9e04bd7f9972250be7b53ee5
;
; Pipeline Runtime Information: 
;
; Compute Shader
; NumThreads=(32,32,1)
;
;
; Buffer Definitions:
;
; cbuffer $Globals
; {
;
;   struct $Globals
;   {
;
;       float3 Resolution;                            ; Offset:    0
;       int IterStep;                                 ; Offset:   16
;   
;   } $Globals;                                       ; Offset:    0 Size:    20
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; $Globals                          cbuffer      NA          NA     CB0            cb0     1
; CurrentFrame                      texture     f32          2d      T0             t0     1
; NormalBuffer                      texture     f32          2d      T1             t1     1
; M1                                texture     f32          2d      T2             t2     1

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.7.2308.16 (52da17e29)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !32, globals: !48)
!1 = !DIFile(filename: "shaders\5CATrousFilterCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16, !24}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 54, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 54, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 54, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 54, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 54, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 54, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 6, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 6, size: 96, align: 32, elements: !18, templateParams: !22)
!18 = !{!19, !20, !21}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, line: 6, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !17, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !{!13, !23}
!23 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 5, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 5, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 5, baseType: !15, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 5, baseType: !15, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!30, !31}
!30 = !DITemplateTypeParameter(name: "element", type: !15)
!31 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!32 = !{!33, !45}
!33 = !DISubprogram(name: "main", scope: !1, file: !1, line: 49, type: !34, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!34 = !DISubroutineType(types: !35)
!35 = !{null, !36}
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 7, baseType: !37)
!37 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 7, size: 96, align: 32, elements: !38, templateParams: !43)
!38 = !{!39, !41, !42}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !37, file: !1, line: 7, baseType: !40, size: 32, align: 32, flags: DIFlagPublic)
!40 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !37, file: !1, line: 7, baseType: !40, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !37, file: !1, line: 7, baseType: !40, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!43 = !{!44, !23}
!44 = !DITemplateTypeParameter(name: "element", type: !40)
!45 = !DISubprogram(name: "AtrousIter", linkageName: "\01?AtrousIter@@YA?AV?$vector@M$02@@V?$vector@H$01@@H@Z", scope: !1, file: !1, line: 9, type: !46, isLocal: false, isDefinition: true, scopeLine: 10, flags: DIFlagPrototyped, isOptimized: false)
!46 = !DISubroutineType(types: !47)
!47 = !{!16, !24, !15}
!48 = !{!49, !49, !51, !51, !53, !57, !58, !61, !62, !64}
!49 = !DIGlobalVariable(name: "Resolution", linkageName: "\01?Resolution@@3V?$vector@M$02@@B", scope: !0, file: !1, line: 6, type: !50, isLocal: false, isDefinition: true)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!51 = !DIGlobalVariable(name: "IterStep", linkageName: "\01?IterStep@@3HB", scope: !0, file: !1, line: 7, type: !52, isLocal: false, isDefinition: true)
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!53 = !DIGlobalVariable(name: "CurrentFrame", linkageName: "\01?CurrentFrame@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 1, type: !54, isLocal: false, isDefinition: true)
!54 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 1, size: 160, align: 32, elements: !2, templateParams: !55)
!55 = !{!56}
!56 = !DITemplateTypeParameter(name: "element", type: !5)
!57 = !DIGlobalVariable(name: "NormalBuffer", linkageName: "\01?NormalBuffer@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 2, type: !54, isLocal: false, isDefinition: true)
!58 = !DIGlobalVariable(name: "M1", linkageName: "\01?M1@@3V?$Texture2D@M@@A", scope: !0, file: !1, line: 3, type: !59, isLocal: false, isDefinition: true)
!59 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<float>", file: !1, line: 3, size: 64, align: 32, elements: !2, templateParams: !60)
!60 = !{!13}
!61 = !DIGlobalVariable(name: "M2", linkageName: "\01?M2@@3V?$Texture2D@M@@A", scope: !0, file: !1, line: 4, type: !59, isLocal: false, isDefinition: true)
!62 = !DIGlobalVariable(name: "ResultTexture", linkageName: "\01?ResultTexture@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 5, type: !63, isLocal: false, isDefinition: true)
!63 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 5, size: 128, align: 32, elements: !2, templateParams: !55)
!64 = !DIGlobalVariable(name: "taps", linkageName: "\01?taps@?1??AtrousIter@@YA?AV?$vector@M$02@@V?$vector@H$01@@H@Z@4QBV3@B.v", scope: !45, file: !1, line: 11, type: !65, isLocal: false, isDefinition: true)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 1600, align: 32, elements: !67)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!67 = !{!68}
!68 = !DISubrange(count: 25)
!69 = !{i32 2, !"Dwarf Version", i32 4}
!70 = !{i32 2, !"Debug Info Version", i32 3}
!71 = !{!"dxcoob 1.7.2308.16 (52da17e29)"}
