#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 133069d4929b15b530ad49f5d007da96.pdb
; shader hash: 133069d4929b15b530ad49f5d007da96
;
; Pipeline Runtime Information: 
;
; Compute Shader
; NumThreads=(32,1,1)
;
;
; Buffer Definitions:
;
; cbuffer $Globals
; {
;
;   struct $Globals
;   {
;
;       float Time;                                   ; Offset:    0
;   
;   } $Globals;                                       ; Offset:    0 Size:     4
;
; }
;
; Resource bind info for Particles
; {
;
;   struct struct.ParticleData
;   {
;
;       float3 position;                              ; Offset:    0
;       float3 velocity;                              ; Offset:   12
;       float3 acceleration;                          ; Offset:   24
;       float3 albedo;                                ; Offset:   36
;       float3 prevPosition;                          ; Offset:   48
;       float radius;                                 ; Offset:   60
;       float elasticity;                             ; Offset:   64
;       float friction;                               ; Offset:   68
;       float reflection;                             ; Offset:   72

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.7.2308.16 (52da17e29)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !15, globals: !34)
!1 = !DIFile(filename: "shaders\5CInitParticlesCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !8}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 24, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 24, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 24, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !{!16, !28, !31}
!16 = !DISubprogram(name: "main", scope: !1, file: !1, line: 21, type: !17, isLocal: false, isDefinition: true, scopeLine: 22, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !19}
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 13, baseType: !20)
!20 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 13, size: 96, align: 32, elements: !21, templateParams: !26)
!21 = !{!22, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !20, file: !1, line: 13, baseType: !23, size: 32, align: 32, flags: DIFlagPublic)
!23 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !20, file: !1, line: 13, baseType: !23, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !20, file: !1, line: 13, baseType: !23, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!26 = !{!27, !13}
!27 = !DITemplateTypeParameter(name: "element", type: !23)
!28 = !DISubprogram(name: "palette", linkageName: "\01?palette@@YA?AV?$vector@M$02@@MV1@000@Z", scope: !1, file: !1, line: 15, type: !29, isLocal: false, isDefinition: true, scopeLine: 16, flags: DIFlagPrototyped, isOptimized: false)
!29 = !DISubroutineType(types: !30)
!30 = !{!4, !8, !4, !4, !4, !4}
!31 = !DISubprogram(name: "rand", linkageName: "\01?rand@@YAMXZ", scope: !1, file: !1, line: 4, type: !32, isLocal: false, isDefinition: true, scopeLine: 5, flags: DIFlagPrototyped, isOptimized: false)
!32 = !DISubroutineType(types: !33)
!33 = !{!8}
!34 = !{!35, !35, !37, !57}
!35 = !DIGlobalVariable(name: "Time", linkageName: "\01?Time@@3MB", scope: !0, file: !1, line: 13, type: !36, isLocal: false, isDefinition: true)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!37 = !DIGlobalVariable(name: "Particles", linkageName: "\01?Particles@@3V?$RWStructuredBuffer@UParticleData@@@@A", scope: !0, file: !1, line: 12, type: !38, isLocal: false, isDefinition: true)
!38 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<ParticleData>", file: !1, line: 12, size: 704, align: 32, elements: !2, templateParams: !39)
!39 = !{!40}
!40 = !DITemplateTypeParameter(name: "element", type: !41)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleData", file: !42, line: 9, size: 704, align: 32, elements: !43)
!42 = !DIFile(filename: "shaders/ParticleConfig.h", directory: "")
!43 = !{!44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !56}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !41, file: !42, line: 11, baseType: !4, size: 96, align: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "velocity", scope: !41, file: !42, line: 12, baseType: !4, size: 96, align: 32, offset: 96)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "acceleration", scope: !41, file: !42, line: 13, baseType: !4, size: 96, align: 32, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "albedo", scope: !41, file: !42, line: 14, baseType: !4, size: 96, align: 32, offset: 288)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "prevPosition", scope: !41, file: !42, line: 15, baseType: !4, size: 96, align: 32, offset: 384)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !41, file: !42, line: 16, baseType: !8, size: 32, align: 32, offset: 480)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "elasticity", scope: !41, file: !42, line: 17, baseType: !8, size: 32, align: 32, offset: 512)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "friction", scope: !41, file: !42, line: 18, baseType: !8, size: 32, align: 32, offset: 544)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !41, file: !42, line: 19, baseType: !8, size: 32, align: 32, offset: 576)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "emissive", scope: !41, file: !42, line: 20, baseType: !8, size: 32, align: 32, offset: 608)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !41, file: !42, line: 21, baseType: !55, size: 32, align: 32, offset: 640)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 26, baseType: !23)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "dynamic", scope: !41, file: !42, line: 22, baseType: !55, size: 32, align: 32, offset: 672)
!57 = !DIGlobalVariable(name: "seed", scope: !0, file: !1, line: 3, type: !4, isLocal: true, isDefinition: true)
!58 = !{i32 2, !"Dwarf Version", i32 4}
!59 = !{i32 2, !"Debug Info Version", i32 3}
!60 = !{!"dxcoob 1.7.2308.16 (52da17e29)"}
!61 = !{!"shaders\5CInitParticlesCS.hlsl", !"#include \22ParticleConfig.h\22\0D\0A\0D\0Astatic float3 seed = float3(1, 1, 1);\0D\0Afloat rand()\0D\0A{\0D\0A    seed = frac(seed * 1.6180339887 + 0.123456789);\0D\0A    float3 s = seed;\0D\0A    float n = dot(s, float3(12.9898, 78.233, 37.719));\0D\0A    return frac(sin(n) * 43758.5453);\0D\0A}\0D\0A\0D\0ARWStructuredBuffer<ParticleData> Particles : register(u0);\0D\0Aconst float Time : register(b0);\0D\0A\0D\0Afloat3 palette(in float t, in float3 a, in float3 b, in float3 c, in float3 d)\0D\0A{\0D\0A    return a + b * cos(6.283185 * (c * t + d));\0D\0A}\0D\0A\0D\0A[numthreads(32, 1, 1)]\0D\0Avoid main( uint3 DTid : SV_DispatchThreadID )\0D\0A{\0D\0A    \0D\0A    float3 color = palette(float(DTid.x) / NUM_PARTICLES, float3(0.5, 0.5, 0.5), float3(0.5, 0.5, 0.5), float3(1.0, 0.7, 0.4), float3(0.0, 0.15, 0.20));\0D\0A    seed += DTid.x + Time;\0D\0A    ParticleData particle = Particles[DTid.x];\0D\0A    if (DTid.x == 0)\0D\0A    {\0D\0A        particle.radius = 100.0;\0D\0A        particle.position = float3(0, particle.radius + 15.0, 0);\0D\0A        particle.elasticity = 1.0;\0D\0A        particle.velocity = 0;\0D\0A        particle.acceleration = 0;\0D\0A        particle.friction = 1.0;\0D\0A        particle.dynamic = false;\0D\0A        particle.emissive = 0;\0D\0A        particle.albedo = color;\0D\0A        particle.reflection = 0.0;\0D\0A    }\0D\0A    else\0D\0A    {\0D\0A        particle.radius = 0.5 + rand() * 4.0;\0D\0A        particle.position = (float3(rand(), rand(), rand()) * 2.0 - 1.0) * 150.0;\0D\0A        particle.elasticity = 0.5 + rand()*0.5;\0D\0A        particle.velocity = particle.position*-0.005;\0D\0A        particle.acceleration = particle.position*-0.001;\0D\0A        particle.friction = 0.5 + rand() * 0.5;\0D\0A        particle.dynamic = true;\0D\0A        particle.emissive = rand() > 0.6 ? 1 : 0;\0D\0A        particle.albedo = color;\0D\0A        particle.reflection = rand();\0D\0A    }\0D\0A    particle.prevPosition = 0;\0D\0A    particle.id = DTid.x + 1;\0D\0A    Particles[DTid.x] = particle;\0D\0A    \0D\0A}"}
!62 = !{!"shaders\5CParticleConfig.h", !"#define NUM_PARTICLES (32*6)\0D\0A\0D\0A#ifdef IS_CPU\0D\0Atypedef ni::Float3 float3;\0D\0Atypedef ni::Float4x4 float4x4;\0D\0Atypedef uint32_t uint;\0D\0A#endif\0D\0A\0D\0Astruct ParticleData\0D\0A{\0D\0A\09float3 position;\0D\0A\09float3 velocity;\0D\0A\09float3 acceleration;\0D\0A\09float3 albedo;\0D\0A\09float3 prevPosition;\0D\0A\09float radius;\0D\0A\09float elasticity;\0D\0A\09float friction;\0D\0A\09float reflection;\0D\0A\09float emissive;\0D\0A\09uint id;\0D\0A\09uint dynamic;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferData\0D\0A{\0D\0A\09float3 cameraPos;\0D\0A\09float _padding0;\0D\0A\09float4x4 invViewProjMtx;\0D\0A\09float3 prevCameraPos;\0D\0A\09float _padding1;\0D\0A\09float4x4 prevInvViewProjMtx;\0D\0A\09float4x4 viewMtx;\0D\0A\09float4x4 viewProjMtx;\0D\0A\09float4x4 prevViewProjMtx;\0D\0A\09float3 resolution;\0D\0A\09float time;\0D\0A\09float frame;\0D\0A};"}
!63 = !{!"shaders\5CInitParticlesCS.hlsl"}
!64 = !{!"-E", !"main", !"-T", !"cs_6_0", !"/Fo", !"D:\5Cdev2\5Cfp2025\5C\5Cbin\5CDebug\5CInitParticlesCS.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!65 = !{i32 1, i32 0}
!66 = !{i32 1, i32 7}
!67 = !{!"cs", i32 6, i32 0}
!68 = !{null, !69, !72, null}
!69 = !{!70}
!70 = !{i32 0, %"class.RWStructuredBuffer<ParticleData>"* undef, !"Particles", i32 0, i32 0, i32 1, i32 12, i1 false, i1 false, i1 false, !71}
!71 = !{i32 1, i32 88}
!72 = !{!73}
!73 = !{i32 0, %"$Globals"* undef, !"$Globals", i32 0, i32 0, i32 1, i32 4, null}
