#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: eb1e91a508fdc5532f019e8ec0d33218.pdb
; shader hash: eb1e91a508fdc5532f019e8ec0d33218
;
; Pipeline Runtime Information: 
;
; Compute Shader
; NumThreads=(32,1,1)
;
;
; Buffer Definitions:
;
; cbuffer $Globals
; {
;
;   struct $Globals
;   {
;
;       float Time;                                   ; Offset:    0
;   
;   } $Globals;                                       ; Offset:    0 Size:     4
;
; }
;
; Resource bind info for Particles
; {
;
;   struct struct.ParticleData
;   {
;
;       float3 position;                              ; Offset:    0
;       float3 prevPosition;                          ; Offset:   12
;       float3 velocity;                              ; Offset:   24
;       float3 acceleration;                          ; Offset:   36
;       float3 albedo;                                ; Offset:   48
;       float radius;                                 ; Offset:   60
;       float elasticity;                             ; Offset:   64
;       float friction;                               ; Offset:   68
;       float reflection;                             ; Offset:   72

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.7.2308.16 (52da17e29)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !15, globals: !34)
!1 = !DIFile(filename: "shaders\5CInitParticlesCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !8}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 25, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 25, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 25, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 25, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 25, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !{!16, !28, !31}
!16 = !DISubprogram(name: "main", scope: !1, file: !1, line: 21, type: !17, isLocal: false, isDefinition: true, scopeLine: 22, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !19}
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 13, baseType: !20)
!20 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 13, size: 96, align: 32, elements: !21, templateParams: !26)
!21 = !{!22, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !20, file: !1, line: 13, baseType: !23, size: 32, align: 32, flags: DIFlagPublic)
!23 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !20, file: !1, line: 13, baseType: !23, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !20, file: !1, line: 13, baseType: !23, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!26 = !{!27, !13}
!27 = !DITemplateTypeParameter(name: "element", type: !23)
!28 = !DISubprogram(name: "palette", linkageName: "\01?palette@@YA?AV?$vector@M$02@@MV1@000@Z", scope: !1, file: !1, line: 15, type: !29, isLocal: false, isDefinition: true, scopeLine: 16, flags: DIFlagPrototyped, isOptimized: false)
!29 = !DISubroutineType(types: !30)
!30 = !{!4, !8, !4, !4, !4, !4}
!31 = !DISubprogram(name: "rand", linkageName: "\01?rand@@YAMXZ", scope: !1, file: !1, line: 4, type: !32, isLocal: false, isDefinition: true, scopeLine: 5, flags: DIFlagPrototyped, isOptimized: false)
!32 = !DISubroutineType(types: !33)
!33 = !{!8}
!34 = !{!35, !35, !37, !38, !39, !60}
!35 = !DIGlobalVariable(name: "Time", linkageName: "\01?Time@@3MB", scope: !0, file: !1, line: 13, type: !36, isLocal: false, isDefinition: true)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!37 = !DIGlobalVariable(name: "bigRadius", scope: !16, file: !1, line: 28, type: !36, isLocal: true, isDefinition: true)
!38 = !DIGlobalVariable(name: "offset", scope: !16, file: !1, line: 29, type: !36, isLocal: true, isDefinition: true)
!39 = !DIGlobalVariable(name: "Particles", linkageName: "\01?Particles@@3V?$RWStructuredBuffer@UParticleData@@@@A", scope: !0, file: !1, line: 12, type: !40, isLocal: false, isDefinition: true)
!40 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<ParticleData>", file: !1, line: 12, size: 736, align: 32, elements: !2, templateParams: !41)
!41 = !{!42}
!42 = !DITemplateTypeParameter(name: "element", type: !43)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleData", file: !44, line: 9, size: 736, align: 32, elements: !45)
!44 = !DIFile(filename: "shaders/ParticleConfig.h", directory: "")
!45 = !{!46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !58, !59}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !43, file: !44, line: 11, baseType: !4, size: 96, align: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "prevPosition", scope: !43, file: !44, line: 12, baseType: !4, size: 96, align: 32, offset: 96)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "velocity", scope: !43, file: !44, line: 13, baseType: !4, size: 96, align: 32, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "acceleration", scope: !43, file: !44, line: 14, baseType: !4, size: 96, align: 32, offset: 288)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "albedo", scope: !43, file: !44, line: 15, baseType: !4, size: 96, align: 32, offset: 384)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !43, file: !44, line: 16, baseType: !8, size: 32, align: 32, offset: 480)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "elasticity", scope: !43, file: !44, line: 17, baseType: !8, size: 32, align: 32, offset: 512)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "friction", scope: !43, file: !44, line: 18, baseType: !8, size: 32, align: 32, offset: 544)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !43, file: !44, line: 19, baseType: !8, size: 32, align: 32, offset: 576)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "emissive", scope: !43, file: !44, line: 20, baseType: !8, size: 32, align: 32, offset: 608)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !43, file: !44, line: 21, baseType: !57, size: 32, align: 32, offset: 640)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 27, baseType: !23)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "dynamic", scope: !43, file: !44, line: 22, baseType: !57, size: 32, align: 32, offset: 672)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "visible", scope: !43, file: !44, line: 23, baseType: !57, size: 32, align: 32, offset: 704)
!60 = !DIGlobalVariable(name: "seed", scope: !0, file: !1, line: 3, type: !4, isLocal: true, isDefinition: true)
!61 = !{i32 2, !"Dwarf Version", i32 4}
!62 = !{i32 2, !"Debug Info Version", i32 3}
!63 = !{!"dxcoob 1.7.2308.16 (52da17e29)"}
