#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 73c4bae667f24bc29b3a23faacb91ca6.pdb
; shader hash: 73c4bae667f24bc29b3a23faacb91ca6
;
; Pipeline Runtime Information: 
;
; Compute Shader
; NumThreads=(1024,1,1)
;
;
; Buffer Definitions:
;
; Resource bind info for Particles
; {
;
;   struct struct.ParticleData
;   {
;
;       float3 position;                              ; Offset:    0
;       float3 velocity;                              ; Offset:   12
;       float3 acceleration;                          ; Offset:   24
;       float3 color;                                 ; Offset:   36
;       float radius;                                 ; Offset:   48
;       float elasticity;                             ; Offset:   52
;       float friction;                               ; Offset:   56
;       bool dynamic;                                 ; Offset:   60
;       bool emits;                                   ; Offset:   64
;   
;   } $Element;                                       ; Offset:    0 Size:    68
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.7.2308.16 (52da17e29)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !22, globals: !38)
!1 = !DIFile(filename: "shaders\5CInitParticles.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !15}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 25, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 25, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 25, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 25, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 25, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 17, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 17, size: 64, align: 32, elements: !17, templateParams: !20)
!17 = !{!18, !19}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 17, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!12, !21}
!21 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!22 = !{!23, !35}
!23 = !DISubprogram(name: "main", scope: !1, file: !1, line: 23, type: !24, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!24 = !DISubroutineType(types: !25)
!25 = !{null, !26}
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !27)
!27 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !28, templateParams: !33)
!28 = !{!29, !31, !32}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !27, file: !1, baseType: !30, size: 32, align: 32, flags: DIFlagPublic)
!30 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !27, file: !1, baseType: !30, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !27, file: !1, baseType: !30, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!33 = !{!34, !13}
!34 = !DITemplateTypeParameter(name: "element", type: !30)
!35 = !DISubprogram(name: "rand", linkageName: "\01?rand@@YAMXZ", scope: !1, file: !1, line: 15, type: !36, isLocal: false, isDefinition: true, scopeLine: 16, flags: DIFlagPrototyped, isOptimized: false)
!36 = !DISubroutineType(types: !37)
!37 = !{!8}
!38 = !{!39, !55}
!39 = !DIGlobalVariable(name: "Particles", linkageName: "\01?Particles@@3V?$RWStructuredBuffer@UParticleData@@@@A", scope: !0, file: !1, line: 20, type: !40, isLocal: false, isDefinition: true)
!40 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<ParticleData>", file: !1, line: 20, size: 544, align: 32, elements: !2, templateParams: !41)
!41 = !{!42}
!42 = !DITemplateTypeParameter(name: "element", type: !43)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleData", file: !1, line: 1, size: 544, align: 32, elements: !44)
!44 = !{!45, !46, !47, !48, !49, !50, !51, !52, !54}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !43, file: !1, line: 3, baseType: !4, size: 96, align: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "velocity", scope: !43, file: !1, line: 4, baseType: !4, size: 96, align: 32, offset: 96)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "acceleration", scope: !43, file: !1, line: 5, baseType: !4, size: 96, align: 32, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !43, file: !1, line: 6, baseType: !4, size: 96, align: 32, offset: 288)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !43, file: !1, line: 7, baseType: !8, size: 32, align: 32, offset: 384)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "elasticity", scope: !43, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 416)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "friction", scope: !43, file: !1, line: 9, baseType: !8, size: 32, align: 32, offset: 448)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "dynamic", scope: !43, file: !1, line: 10, baseType: !53, size: 32, align: 32, offset: 480)
!53 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "emits", scope: !43, file: !1, line: 11, baseType: !53, size: 32, align: 32, offset: 512)
!55 = !DIGlobalVariable(name: "seed", scope: !0, file: !1, line: 14, type: !4, isLocal: true, isDefinition: true)
!56 = !{i32 2, !"Dwarf Version", i32 4}
!57 = !{i32 2, !"Debug Info Version", i32 3}
!58 = !{!"dxcoob 1.7.2308.16 (52da17e29)"}
!59 = !{!"shaders\5CInitParticles.hlsl", !"struct ParticleData\0D\0A{\0D\0A    float3 position;\0D\0A    float3 velocity;\0D\0A    float3 acceleration;\0D\0A    float3 color;\0D\0A    float radius;\0D\0A    float elasticity;\0D\0A    float friction;\0D\0A    bool dynamic;\0D\0A    bool emits;\0D\0A};\0D\0A\0D\0Astatic float3 seed = 1;\0D\0Afloat rand()\0D\0A{\0D\0A    return frac(sin(frac(sin(dot(seed.xy, float2(12.98, 78.23)) * (seed.z += 13.)) * 437.54)) * 73.54);\0D\0A}\0D\0A\0D\0ARWStructuredBuffer<ParticleData> Particles : register(u0);\0D\0A\0D\0A[numthreads(1024, 1, 1)]\0D\0Avoid main( uint3 DTid : SV_DispatchThreadID )\0D\0A{\0D\0A    ParticleData particle = Particles[DTid.x];\0D\0A    if (DTid.x == 0)\0D\0A    {\0D\0A        particle.radius = 1000000.0;\0D\0A        particle.position = float3(0, particle.radius + 10.0, 0);\0D\0A        particle.elasticity = 1.0;\0D\0A        particle.velocity = 0;\0D\0A        particle.acceleration = 0;\0D\0A        particle.friction = 1.0;\0D\0A        particle.dynamic = false;\0D\0A        particle.emits = false;\0D\0A        Particles[DTid.x] = particle;\0D\0A    }\0D\0A    else\0D\0A    {\0D\0A        seed *= DTid.x;\0D\0A        particle.radius = 1.0 + rand() * 2.0;\0D\0A        particle.position = (float3(rand(), rand(), rand()) * 2.0 - 1.0) * 50.0;\0D\0A        particle.elasticity = 0.4;\0D\0A        particle.velocity = (float3(rand(), rand(), rand()) * 2.0 - 1.0) * -0.2;;\0D\0A        particle.acceleration = float3(0.0, 0.098, 0.0);\0D\0A        particle.friction = 0.1;\0D\0A        particle.dynamic = true;\0D\0A        particle.emits = rand() > 0.8;\0D\0A        Particles[DTid.x] = particle;\0D\0A    }\0D\0A    \0D\0A}"}
!60 = !{!"shaders\5CInitParticles.hlsl"}
!61 = !{!"-E", !"main", !"-T", !"cs_6_0", !"/Fo", !"D:\5Cdev2\5Cfp2025\5C\5Cbin\5CDebug\5CInitParticles.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!62 = !{i32 1, i32 0}
!63 = !{i32 1, i32 7}
!64 = !{!"cs", i32 6, i32 0}
!65 = !{null, !66, null, null}
!66 = !{!67}
!67 = !{i32 0, %"class.RWStructuredBuffer<ParticleData>"* undef, !"Particles", i32 0, i32 0, i32 1, i32 12, i1 false, i1 false, i1 false, !68}
!68 = !{i32 1, i32 68}
!69 = !{i32 0, %"class.RWStructuredBuffer<ParticleData>" undef, !70, %struct.ParticleData undef, !72}
!70 = !{i32 80, !71}
!71 = !{i32 6, !"h", i32 3, i32 0}
!72 = !{i32 80, !73, !74, !75, !76, !77, !78, !79, !80, !81}
!73 = !{i32 6, !"position", i32 3, i32 0, i32 7, i32 9}
!74 = !{i32 6, !"velocity", i32 3, i32 16, i32 7, i32 9}
!75 = !{i32 6, !"acceleration", i32 3, i32 32, i32 7, i32 9}
!76 = !{i32 6, !"color", i32 3, i32 48, i32 7, i32 9}
!77 = !{i32 6, !"radius", i32 3, i32 60, i32 7, i32 9}
!78 = !{i32 6, !"elasticity", i32 3, i32 64, i32 7, i32 9}
!79 = !{i32 6, !"friction", i32 3, i32 68, i32 7, i32 9}
!80 = !{i32 6, !"dynamic", i32 3, i32 72, i32 7, i32 1}
!81 = !{i32 6, !"emits", i32 3, i32 76, i32 7, i32 1}
!82 = !{i32 1, void ()* @main, !83}
!83 = !{!84}
!84 = !{i32 0, !2, !2}
!85 = !{void ()* @main, !"main", null, !65, !86}
!86 = !{i32 0, i64 17, i32 4, !87}
!87 = !{i32 1024, i32 1, i32 1}
!88 = !DILocation(line: 25, column: 29, scope: !23)
!89 = !DILocation(line: 14, scope: !23)
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "global.seed", arg: 0, scope: !23, file: !1, line: 14, type: !4)
!91 = !DIExpression()
!92 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "DTid", arg: 1, scope: !23, file: !1, line: 23, type: !26)
!93 = !DIExpression(DW_OP_bit_piece, 0, 32)
!94 = !DILocation(line: 23, column: 18, scope: !23)
!95 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "particle", scope: !23, file: !1, line: 25, type: !43)
