#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 2ed7fd12f0d95b413ae9b2e79b506f2c.pdb
; shader hash: 2ed7fd12f0d95b413ae9b2e79b506f2c
;
; Pipeline Runtime Information: 
;
; Compute Shader
; NumThreads=(32,32,1)
;
;
; Buffer Definitions:
;
; cbuffer ConstantData
; {
;
;   struct hostlayout.ConstantData
;   {
;
;       struct hostlayout.struct.ConstantBufferData
;       {
;
;           float3 cameraPos;                         ; Offset:    0
;           float _padding0;                          ; Offset:   12
;           column_major float4x4 invViewProjMtx;     ; Offset:   16
;           float3 prevCameraPos;                     ; Offset:   80
;           float _padding1;                          ; Offset:   92
;           column_major float4x4 prevInvViewProjMtx; ; Offset:   96
;           column_major float4x4 viewMtx;            ; Offset:  160
;           column_major float4x4 viewProjMtx;        ; Offset:  224
;           column_major float4x4 prevViewProjMtx;    ; Offset:  288
;           float3 resolution;                        ; Offset:  352
;           float time;                               ; Offset:  364

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.7.2308.16 (52da17e29)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !120)
!1 = !DIFile(filename: "shaders\5CParticleBasePassCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !8, !23}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 202, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 202, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 202, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 202, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 215, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 215, size: 128, align: 32, elements: !16, templateParams: !21)
!16 = !{!17, !18, !19, !20}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 215, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 215, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, line: 215, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !15, file: !1, line: 215, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!21 = !{!11, !22}
!22 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 203, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 203, size: 96, align: 32, elements: !25, templateParams: !29)
!25 = !{!26, !27, !28}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !24, file: !1, line: 203, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !24, file: !1, line: 203, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !24, file: !1, line: 203, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!29 = !{!11, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!31 = !{!32, !44, !69, !72, !75, !78, !103, !109, !112, !115, !116, !119}
!32 = !DISubprogram(name: "main", scope: !1, file: !1, line: 200, type: !33, isLocal: false, isDefinition: true, scopeLine: 201, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!33 = !DISubroutineType(types: !34)
!34 = !{null, !35}
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !37, templateParams: !42)
!37 = !{!38, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !36, file: !1, baseType: !39, size: 32, align: 32, flags: DIFlagPublic)
!39 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !36, file: !1, baseType: !39, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !36, file: !1, baseType: !39, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!42 = !{!43, !30}
!43 = !DITemplateTypeParameter(name: "element", type: !39)
!44 = !DISubprogram(name: "CalcPositionNormalAndVelocity", linkageName: "\01?CalcPositionNormalAndVelocity@@YA_NV?$vector@M$01@@AIAV?$vector@M$02@@1AIAV1@UParticleData@@@Z", scope: !1, file: !1, line: 159, type: !45, isLocal: false, isDefinition: true, scopeLine: 160, flags: DIFlagPrototyped, isOptimized: false)
!45 = !DISubroutineType(types: !46)
!46 = !{!47, !4, !48, !48, !50, !52}
!47 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!48 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !49)
!49 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !23)
!50 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !4)
!52 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !53)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleData", file: !54, line: 9, size: 704, align: 32, elements: !55)
!54 = !DIFile(filename: "shaders/ParticleConfig.h", directory: "")
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !68}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !53, file: !54, line: 11, baseType: !23, size: 96, align: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "prevPosition", scope: !53, file: !54, line: 12, baseType: !23, size: 96, align: 32, offset: 96)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "velocity", scope: !53, file: !54, line: 13, baseType: !23, size: 96, align: 32, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "acceleration", scope: !53, file: !54, line: 14, baseType: !23, size: 96, align: 32, offset: 288)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "albedo", scope: !53, file: !54, line: 15, baseType: !23, size: 96, align: 32, offset: 384)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !53, file: !54, line: 16, baseType: !8, size: 32, align: 32, offset: 480)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "elasticity", scope: !53, file: !54, line: 17, baseType: !8, size: 32, align: 32, offset: 512)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "friction", scope: !53, file: !54, line: 18, baseType: !8, size: 32, align: 32, offset: 544)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !53, file: !54, line: 19, baseType: !8, size: 32, align: 32, offset: 576)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "emissive", scope: !53, file: !54, line: 20, baseType: !8, size: 32, align: 32, offset: 608)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !53, file: !54, line: 21, baseType: !67, size: 32, align: 32, offset: 640)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 209, baseType: !39)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "dynamic", scope: !53, file: !54, line: 22, baseType: !67, size: 32, align: 32, offset: 672)
!69 = !DISubprogram(name: "Trace", linkageName: "\01?Trace@@YA_NV?$vector@M$02@@0UParticleData@@AIAV1@2@Z", scope: !1, file: !1, line: 56, type: !70, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false)
!70 = !DISubroutineType(types: !71)
!71 = !{!47, !23, !23, !52, !48, !48}
!72 = !DISubprogram(name: "IntersectsParticle", linkageName: "\01?IntersectsParticle@@YA_NV?$vector@M$02@@0UParticleData@@AIAV1@2@Z", scope: !1, file: !1, line: 24, type: !73, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: false)
!73 = !DISubroutineType(types: !74)
!74 = !{!47, !23, !23, !53, !48, !48}
!75 = !DISubprogram(name: "toRad", linkageName: "\01?toRad@@YAMM@Z", scope: !54, file: !54, line: 42, type: !76, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: false)
!76 = !DISubroutineType(types: !77)
!77 = !{!8, !8}
!78 = !DISubprogram(name: "CreateRayFromUV", linkageName: "\01?CreateRayFromUV@@YAXV?$vector@M$01@@V?$matrix@M$03$03@@V?$vector@M$02@@AIAV3@3@Z", scope: !1, file: !1, line: 15, type: !79, isLocal: false, isDefinition: true, scopeLine: 16, flags: DIFlagPrototyped, isOptimized: false)
!79 = !DISubroutineType(types: !80)
!80 = !{null, !4, !81, !23, !48, !48}
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 8, baseType: !82)
!82 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 8, size: 512, align: 32, elements: !83, templateParams: !100)
!83 = !{!84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !82, file: !1, line: 8, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !82, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !82, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !82, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !82, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !82, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !82, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !82, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !82, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !82, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !82, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !82, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !82, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !82, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !82, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !82, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!100 = !{!11, !101, !102}
!101 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 4)
!102 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 4)
!103 = !DISubprogram(name: "Pathtrace", linkageName: "\01?Pathtrace@@YA?AUPathtraceOutput@@V?$vector@M$02@@0@Z", scope: !1, file: !1, line: 128, type: !104, isLocal: false, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: false)
!104 = !DISubroutineType(types: !105)
!105 = !{!106, !23, !23}
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "PathtraceOutput", file: !1, line: 10, size: 96, align: 32, elements: !107)
!107 = !{!108}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !106, file: !1, line: 12, baseType: !23, size: 96, align: 32)
!109 = !DISubprogram(name: "GetCosineWeightedSample", linkageName: "\01?GetCosineWeightedSample@@YA?AV?$vector@M$02@@V1@@Z", scope: !1, file: !1, line: 118, type: !110, isLocal: false, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: false)
!110 = !DISubroutineType(types: !111)
!111 = !{!23, !23}
!112 = !DISubprogram(name: "GetSampleBiased", linkageName: "\01?GetSampleBiased@@YA?AV?$vector@M$02@@V1@M@Z", scope: !1, file: !1, line: 96, type: !113, isLocal: false, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: false)
!113 = !DISubroutineType(types: !114)
!114 = !{!23, !23, !8}
!115 = !DISubprogram(name: "ortho", linkageName: "\01?ortho@@YA?AV?$vector@M$02@@V1@@Z", scope: !1, file: !1, line: 89, type: !110, isLocal: false, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: false)
!116 = !DISubprogram(name: "rand2n", linkageName: "\01?rand2n@@YA?AV?$vector@M$01@@XZ", scope: !1, file: !1, line: 81, type: !117, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: false)
!117 = !DISubroutineType(types: !118)
!118 = !{!4}
!119 = !DISubprogram(name: "GetBackground", linkageName: "\01?GetBackground@@YA?AV?$vector@M$02@@V1@@Z", scope: !1, file: !1, line: 123, type: !110, isLocal: false, isDefinition: true, scopeLine: 124, flags: DIFlagPrototyped, isOptimized: false)
!120 = !{!121, !123, !127, !131, !132, !133, !134, !152, !154}
!121 = !DIGlobalVariable(name: "samples", scope: !32, file: !1, line: 235, type: !122, isLocal: true, isDefinition: true)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!123 = !DIGlobalVariable(name: "Particles", linkageName: "\01?Particles@@3V?$StructuredBuffer@UParticleData@@@@A", scope: !0, file: !1, line: 3, type: !124, isLocal: false, isDefinition: true)
!124 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<ParticleData>", file: !1, line: 3, size: 704, align: 32, elements: !2, templateParams: !125)
!125 = !{!126}
!126 = !DITemplateTypeParameter(name: "element", type: !53)
!127 = !DIGlobalVariable(name: "OutputTexture", linkageName: "\01?OutputTexture@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 4, type: !128, isLocal: false, isDefinition: true)
!128 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 4, size: 128, align: 32, elements: !2, templateParams: !129)
!129 = !{!130}
!130 = !DITemplateTypeParameter(name: "element", type: !15)
!131 = !DIGlobalVariable(name: "VelocityBuffer", linkageName: "\01?VelocityBuffer@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 5, type: !128, isLocal: false, isDefinition: true)
!132 = !DIGlobalVariable(name: "PositionBuffer", linkageName: "\01?PositionBuffer@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 6, type: !128, isLocal: false, isDefinition: true)
!133 = !DIGlobalVariable(name: "NormalBuffer", linkageName: "\01?NormalBuffer@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 7, type: !128, isLocal: false, isDefinition: true)
!134 = !DIGlobalVariable(name: "ConstantData", linkageName: "\01?ConstantData@@3U?$ConstantBuffer@UConstantBufferData@@@@A", scope: !0, file: !1, line: 8, type: !135, isLocal: false, isDefinition: true)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferData>", file: !1, line: 8, size: 32, align: 32, elements: !2, templateParams: !136)
!136 = !{!137}
!137 = !DITemplateTypeParameter(name: "T", type: !138)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferData", file: !54, line: 25, size: 2976, align: 32, elements: !139)
!139 = !{!140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "cameraPos", scope: !138, file: !54, line: 27, baseType: !23, size: 96, align: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_padding0", scope: !138, file: !54, line: 28, baseType: !8, size: 32, align: 32, offset: 96)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "invViewProjMtx", scope: !138, file: !54, line: 29, baseType: !81, size: 512, align: 32, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "prevCameraPos", scope: !138, file: !54, line: 30, baseType: !23, size: 96, align: 32, offset: 640)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_padding1", scope: !138, file: !54, line: 31, baseType: !8, size: 32, align: 32, offset: 736)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "prevInvViewProjMtx", scope: !138, file: !54, line: 32, baseType: !81, size: 512, align: 32, offset: 768)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "viewMtx", scope: !138, file: !54, line: 33, baseType: !81, size: 512, align: 32, offset: 1280)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "viewProjMtx", scope: !138, file: !54, line: 34, baseType: !81, size: 512, align: 32, offset: 1792)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "prevViewProjMtx", scope: !138, file: !54, line: 35, baseType: !81, size: 512, align: 32, offset: 2304)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "resolution", scope: !138, file: !54, line: 36, baseType: !23, size: 96, align: 32, offset: 2816)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !138, file: !54, line: 37, baseType: !8, size: 32, align: 32, offset: 2912)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !138, file: !54, line: 38, baseType: !8, size: 32, align: 32, offset: 2944)
!152 = !DIGlobalVariable(name: "PI", scope: !0, file: !1, line: 95, type: !153, isLocal: true, isDefinition: true)
!153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!154 = !DIGlobalVariable(name: "seed2", scope: !0, file: !1, line: 80, type: !4, isLocal: true, isDefinition: true)
!155 = !{i32 2, !"Dwarf Version", i32 4}
!156 = !{i32 2, !"Debug Info Version", i32 3}
!157 = !{!"dxcoob 1.7.2308.16 (52da17e29)"}
