#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: bf9e6861f3a4060f3176527be884d5b1.pdb
; shader hash: bf9e6861f3a4060f3176527be884d5b1
;
; Pipeline Runtime Information: 
;
; Compute Shader
; NumThreads=(32,1,1)
;
;
; Buffer Definitions:
;
; cbuffer $Globals
; {
;
;   struct $Globals
;   {
;
;       float Time;                                   ; Offset:    0
;   
;   } $Globals;                                       ; Offset:    0 Size:     4
;
; }
;
; Resource bind info for Particles
; {
;
;   struct struct.ParticleData
;   {
;
;       float3 position;                              ; Offset:    0
;       float3 prevPosition;                          ; Offset:   12
;       float3 velocity;                              ; Offset:   24
;       float3 acceleration;                          ; Offset:   36
;       float3 albedo;                                ; Offset:   48
;       float radius;                                 ; Offset:   60
;       float elasticity;                             ; Offset:   64
;       float friction;                               ; Offset:   68
;       float reflection;                             ; Offset:   72

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.7.2308.16 (52da17e29)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !15, globals: !52)
!1 = !DIFile(filename: "shaders\5CSimulateCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 88, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 88, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 88, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 88, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 88, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !{!16, !28, !49}
!16 = !DISubprogram(name: "main", scope: !1, file: !1, line: 86, type: !17, isLocal: false, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !19}
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 4, baseType: !20)
!20 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 4, size: 96, align: 32, elements: !21, templateParams: !26)
!21 = !{!22, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !20, file: !1, line: 4, baseType: !23, size: 32, align: 32, flags: DIFlagPublic)
!23 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !20, file: !1, line: 4, baseType: !23, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !20, file: !1, line: 4, baseType: !23, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!26 = !{!27, !13}
!27 = !DITemplateTypeParameter(name: "element", type: !23)
!28 = !DISubprogram(name: "HandleDynamicParticleResponse", linkageName: "\01?HandleDynamicParticleResponse@@YAXUParticleData@@0@Z", scope: !1, file: !1, line: 54, type: !29, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false)
!29 = !DISubroutineType(types: !30)
!30 = !{null, !31, !31}
!31 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleData", file: !33, line: 9, size: 736, align: 32, elements: !34)
!33 = !DIFile(filename: "shaders/ParticleConfig.h", directory: "")
!34 = !{!35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !47, !48}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !32, file: !33, line: 11, baseType: !4, size: 96, align: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "prevPosition", scope: !32, file: !33, line: 12, baseType: !4, size: 96, align: 32, offset: 96)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "velocity", scope: !32, file: !33, line: 13, baseType: !4, size: 96, align: 32, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "acceleration", scope: !32, file: !33, line: 14, baseType: !4, size: 96, align: 32, offset: 288)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "albedo", scope: !32, file: !33, line: 15, baseType: !4, size: 96, align: 32, offset: 384)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !32, file: !33, line: 16, baseType: !8, size: 32, align: 32, offset: 480)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "elasticity", scope: !32, file: !33, line: 17, baseType: !8, size: 32, align: 32, offset: 512)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "friction", scope: !32, file: !33, line: 18, baseType: !8, size: 32, align: 32, offset: 544)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !32, file: !33, line: 19, baseType: !8, size: 32, align: 32, offset: 576)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "emissive", scope: !32, file: !33, line: 20, baseType: !8, size: 32, align: 32, offset: 608)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !32, file: !33, line: 21, baseType: !46, size: 32, align: 32, offset: 640)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 88, baseType: !23)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "dynamic", scope: !32, file: !33, line: 22, baseType: !46, size: 32, align: 32, offset: 672)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "visible", scope: !32, file: !33, line: 23, baseType: !46, size: 32, align: 32, offset: 704)
!49 = !DISubprogram(name: "HandleStaticParticleResponse", linkageName: "\01?HandleStaticParticleResponse@@YAXUParticleData@@U1@@Z", scope: !1, file: !1, line: 21, type: !50, isLocal: false, isDefinition: true, scopeLine: 22, flags: DIFlagPrototyped, isOptimized: false)
!50 = !DISubroutineType(types: !51)
!51 = !{null, !31, !32}
!52 = !{!53, !53, !55, !59, !60}
!53 = !DIGlobalVariable(name: "Time", linkageName: "\01?Time@@3MB", scope: !0, file: !1, line: 4, type: !54, isLocal: false, isDefinition: true)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!55 = !DIGlobalVariable(name: "Particles", linkageName: "\01?Particles@@3V?$RWStructuredBuffer@UParticleData@@@@A", scope: !0, file: !1, line: 3, type: !56, isLocal: false, isDefinition: true)
!56 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<ParticleData>", file: !1, line: 3, size: 736, align: 32, elements: !2, templateParams: !57)
!57 = !{!58}
!58 = !DITemplateTypeParameter(name: "element", type: !32)
!59 = !DIGlobalVariable(name: "percent", scope: !49, file: !1, line: 32, type: !54, isLocal: true, isDefinition: true)
!60 = !DIGlobalVariable(name: "slop", scope: !49, file: !1, line: 33, type: !54, isLocal: true, isDefinition: true)
!61 = !{i32 2, !"Dwarf Version", i32 4}
!62 = !{i32 2, !"Debug Info Version", i32 3}
!63 = !{!"dxcoob 1.7.2308.16 (52da17e29)"}
