#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 3d3bd1909932dbb45efccca20cd09ed4.pdb
; shader hash: 3d3bd1909932dbb45efccca20cd09ed4
;
; Pipeline Runtime Information: 
;
; Compute Shader
; NumThreads=(32,1,1)
;
;
; Buffer Definitions:
;
; Resource bind info for Particles
; {
;
;   struct struct.ParticleData
;   {
;
;       float3 position;                              ; Offset:    0
;       float3 velocity;                              ; Offset:   12
;       float3 acceleration;                          ; Offset:   24
;       float3 albedo;                                ; Offset:   36
;       float3 prevPosition;                          ; Offset:   48
;       float radius;                                 ; Offset:   60
;       float elasticity;                             ; Offset:   64
;       float friction;                               ; Offset:   68
;       float reflection;                             ; Offset:   72
;       float emissive;                               ; Offset:   76
;       uint id;                                      ; Offset:   80
;       uint dynamic;                                 ; Offset:   84
;   

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.7.2308.16 (52da17e29)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, subprograms: !3, globals: !47)
!1 = !DIFile(filename: "shaders\5CSimulateCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !18}
!4 = !DISubprogram(name: "main", scope: !1, file: !1, line: 68, type: !5, isLocal: false, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!5 = !DISubroutineType(types: !6)
!6 = !{null, !7}
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !8)
!8 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !9, templateParams: !14)
!9 = !{!10, !12, !13}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !8, file: !1, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!11 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !8, file: !1, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !8, file: !1, baseType: !11, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!14 = !{!15, !16}
!15 = !DITemplateTypeParameter(name: "element", type: !11)
!16 = !DITemplateValueParameter(name: "element_count", type: !17, value: i32 3)
!17 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!18 = !DISubprogram(name: "HandleDynamicParticleResponse", linkageName: "\01?HandleDynamicParticleResponse@@YAXUParticleData@@0@Z", scope: !1, file: !1, line: 37, type: !19, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false)
!19 = !DISubroutineType(types: !20)
!20 = !{null, !21, !21}
!21 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !22)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleData", file: !23, line: 9, size: 704, align: 32, elements: !24)
!23 = !DIFile(filename: "shaders/ParticleConfig.h", directory: "")
!24 = !{!25, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !46}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !22, file: !23, line: 11, baseType: !26, size: 96, align: 32)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 70, baseType: !27)
!27 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 70, size: 96, align: 32, elements: !28, templateParams: !33)
!28 = !{!29, !31, !32}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !27, file: !1, line: 70, baseType: !30, size: 32, align: 32, flags: DIFlagPublic)
!30 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !27, file: !1, line: 70, baseType: !30, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !27, file: !1, line: 70, baseType: !30, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!33 = !{!34, !16}
!34 = !DITemplateTypeParameter(name: "element", type: !30)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "velocity", scope: !22, file: !23, line: 12, baseType: !26, size: 96, align: 32, offset: 96)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "acceleration", scope: !22, file: !23, line: 13, baseType: !26, size: 96, align: 32, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "albedo", scope: !22, file: !23, line: 14, baseType: !26, size: 96, align: 32, offset: 288)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "prevPosition", scope: !22, file: !23, line: 15, baseType: !26, size: 96, align: 32, offset: 384)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !22, file: !23, line: 16, baseType: !30, size: 32, align: 32, offset: 480)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "elasticity", scope: !22, file: !23, line: 17, baseType: !30, size: 32, align: 32, offset: 512)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "friction", scope: !22, file: !23, line: 18, baseType: !30, size: 32, align: 32, offset: 544)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !22, file: !23, line: 19, baseType: !30, size: 32, align: 32, offset: 576)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "emissive", scope: !22, file: !23, line: 20, baseType: !30, size: 32, align: 32, offset: 608)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !22, file: !23, line: 21, baseType: !45, size: 32, align: 32, offset: 640)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 70, baseType: !11)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "dynamic", scope: !22, file: !23, line: 22, baseType: !45, size: 32, align: 32, offset: 672)
!47 = !{!48}
!48 = !DIGlobalVariable(name: "Particles", linkageName: "\01?Particles@@3V?$RWStructuredBuffer@UParticleData@@@@A", scope: !0, file: !1, line: 3, type: !49, isLocal: false, isDefinition: true)
!49 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<ParticleData>", file: !1, line: 3, size: 704, align: 32, elements: !2, templateParams: !50)
!50 = !{!51}
!51 = !DITemplateTypeParameter(name: "element", type: !22)
!52 = !{i32 2, !"Dwarf Version", i32 4}
!53 = !{i32 2, !"Debug Info Version", i32 3}
!54 = !{!"dxcoob 1.7.2308.16 (52da17e29)"}
