#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: d1fb1dcb809933bce16597c24c1d7165.pdb
; shader hash: d1fb1dcb809933bce16597c24c1d7165
;
; Pipeline Runtime Information: 
;
; Compute Shader
; NumThreads=(32,32,1)
;
;
; Buffer Definitions:
;
; cbuffer ConstantData
; {
;
;   struct hostlayout.ConstantData
;   {
;
;       struct hostlayout.struct.ConstantBufferData
;       {
;
;           float3 cameraPos;                         ; Offset:    0
;           float _padding0;                          ; Offset:   12
;           column_major float4x4 invViewProjMtx;     ; Offset:   16
;           float3 prevCameraPos;                     ; Offset:   80
;           float _padding1;                          ; Offset:   92
;           column_major float4x4 prevInvViewProjMtx; ; Offset:   96
;           column_major float4x4 viewMtx;            ; Offset:  160
;           column_major float4x4 viewProjMtx;        ; Offset:  224
;           column_major float4x4 prevViewProjMtx;    ; Offset:  288
;           float3 resolution;                        ; Offset:  352
;           float time;                               ; Offset:  364

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.7.2308.16 (52da17e29)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !47, globals: !63)
!1 = !DIFile(filename: "shaders\5CTemporalReprojectionCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !6, !16, !25, !32, !38}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 37, baseType: !5)
!5 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 40, baseType: !7)
!7 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 40, size: 64, align: 32, elements: !8, templateParams: !12)
!8 = !{!9, !11}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !7, file: !1, line: 40, baseType: !10, size: 32, align: 32, flags: DIFlagPublic)
!10 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !7, file: !1, line: 40, baseType: !10, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !10)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "int3", file: !1, line: 41, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 3>", file: !1, line: 41, size: 96, align: 32, elements: !18, templateParams: !22)
!18 = !{!19, !20, !21}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, line: 41, baseType: !15, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, line: 41, baseType: !15, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !17, file: !1, line: 41, baseType: !15, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !{!23, !24}
!23 = !DITemplateTypeParameter(name: "element", type: !15)
!24 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 41, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 41, size: 96, align: 32, elements: !27, templateParams: !31)
!27 = !{!28, !29, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, line: 41, baseType: !10, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, line: 41, baseType: !10, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !26, file: !1, line: 41, baseType: !10, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!31 = !{!13, !24}
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 79, baseType: !33)
!33 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 79, size: 64, align: 32, elements: !34, templateParams: !37)
!34 = !{!35, !36}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !33, file: !1, line: 79, baseType: !15, size: 32, align: 32, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !33, file: !1, line: 79, baseType: !15, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!37 = !{!23, !14}
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 121, baseType: !39)
!39 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 121, size: 128, align: 32, elements: !40, templateParams: !45)
!40 = !{!41, !42, !43, !44}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !39, file: !1, line: 121, baseType: !10, size: 32, align: 32, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !39, file: !1, line: 121, baseType: !10, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !39, file: !1, line: 121, baseType: !10, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !39, file: !1, line: 121, baseType: !10, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!45 = !{!13, !46}
!46 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!47 = !{!48, !59, !62}
!48 = !DISubprogram(name: "main", scope: !1, file: !1, line: 34, type: !49, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!49 = !DISubroutineType(types: !50)
!50 = !{null, !51}
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !52)
!52 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !53, templateParams: !57)
!53 = !{!54, !55, !56}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !52, file: !1, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !52, file: !1, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !52, file: !1, baseType: !5, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!57 = !{!58, !24}
!58 = !DITemplateTypeParameter(name: "element", type: !5)
!59 = !DISubprogram(name: "LinearDepthFromPos", linkageName: "\01?LinearDepthFromPos@@YAMV?$vector@M$02@@@Z", scope: !1, file: !1, line: 26, type: !60, isLocal: false, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: false)
!60 = !DISubroutineType(types: !61)
!61 = !{!10, !25}
!62 = !DISubprogram(name: "Luma", linkageName: "\01?Luma@@YAMV?$vector@M$02@@@Z", scope: !1, file: !1, line: 21, type: !60, isLocal: false, isDefinition: true, scopeLine: 22, flags: DIFlagPrototyped, isOptimized: false)
!63 = !{!64, !68, !69, !70, !71, !72, !73, !74, !77, !78, !80, !82, !83, !124}
!64 = !DIGlobalVariable(name: "CurrentFrame", linkageName: "\01?CurrentFrame@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 3, type: !65, isLocal: false, isDefinition: true)
!65 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 3, size: 160, align: 32, elements: !2, templateParams: !66)
!66 = !{!67}
!67 = !DITemplateTypeParameter(name: "element", type: !39)
!68 = !DIGlobalVariable(name: "VelocityBuffer", linkageName: "\01?VelocityBuffer@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 4, type: !65, isLocal: false, isDefinition: true)
!69 = !DIGlobalVariable(name: "HistoryBuffer", linkageName: "\01?HistoryBuffer@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 5, type: !65, isLocal: false, isDefinition: true)
!70 = !DIGlobalVariable(name: "PositionBuffer", linkageName: "\01?PositionBuffer@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 6, type: !65, isLocal: false, isDefinition: true)
!71 = !DIGlobalVariable(name: "NormalBuffer", linkageName: "\01?NormalBuffer@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 7, type: !65, isLocal: false, isDefinition: true)
!72 = !DIGlobalVariable(name: "PrevPositionBuffer", linkageName: "\01?PrevPositionBuffer@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 8, type: !65, isLocal: false, isDefinition: true)
!73 = !DIGlobalVariable(name: "PrevNormalBuffer", linkageName: "\01?PrevNormalBuffer@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 9, type: !65, isLocal: false, isDefinition: true)
!74 = !DIGlobalVariable(name: "HistoryM1Prev", linkageName: "\01?HistoryM1Prev@@3V?$Texture2D@M@@A", scope: !0, file: !1, line: 10, type: !75, isLocal: false, isDefinition: true)
!75 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<float>", file: !1, line: 10, size: 64, align: 32, elements: !2, templateParams: !76)
!76 = !{!13}
!77 = !DIGlobalVariable(name: "HistoryM2Prev", linkageName: "\01?HistoryM2Prev@@3V?$Texture2D@M@@A", scope: !0, file: !1, line: 11, type: !75, isLocal: false, isDefinition: true)
!78 = !DIGlobalVariable(name: "ResultTexture", linkageName: "\01?ResultTexture@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 13, type: !79, isLocal: false, isDefinition: true)
!79 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 13, size: 128, align: 32, elements: !2, templateParams: !66)
!80 = !DIGlobalVariable(name: "HistoryM1Out", linkageName: "\01?HistoryM1Out@@3V?$RWTexture2D@M@@A", scope: !0, file: !1, line: 14, type: !81, isLocal: false, isDefinition: true)
!81 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<float>", file: !1, line: 14, size: 32, align: 32, elements: !2, templateParams: !76)
!82 = !DIGlobalVariable(name: "HistoryM2Out", linkageName: "\01?HistoryM2Out@@3V?$RWTexture2D@M@@A", scope: !0, file: !1, line: 15, type: !81, isLocal: false, isDefinition: true)
!83 = !DIGlobalVariable(name: "ConstantData", linkageName: "\01?ConstantData@@3U?$ConstantBuffer@UConstantBufferData@@@@A", scope: !0, file: !1, line: 17, type: !84, isLocal: false, isDefinition: true)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferData>", file: !1, line: 17, size: 32, align: 32, elements: !2, templateParams: !85)
!85 = !{!86}
!86 = !DITemplateTypeParameter(name: "T", type: !87)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferData", file: !88, line: 25, size: 2976, align: 32, elements: !89)
!88 = !DIFile(filename: "shaders/ParticleConfig.h", directory: "")
!89 = !{!90, !91, !92, !115, !116, !117, !118, !119, !120, !121, !122, !123}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "cameraPos", scope: !87, file: !88, line: 27, baseType: !25, size: 96, align: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_padding0", scope: !87, file: !88, line: 28, baseType: !10, size: 32, align: 32, offset: 96)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "invViewProjMtx", scope: !87, file: !88, line: 29, baseType: !93, size: 512, align: 32, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 17, baseType: !94)
!94 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 17, size: 512, align: 32, elements: !95, templateParams: !112)
!95 = !{!96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !94, file: !1, line: 17, baseType: !10, size: 32, align: 32, flags: DIFlagPublic)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !94, file: !1, line: 17, baseType: !10, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !94, file: !1, line: 17, baseType: !10, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !94, file: !1, line: 17, baseType: !10, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !94, file: !1, line: 17, baseType: !10, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !94, file: !1, line: 17, baseType: !10, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !94, file: !1, line: 17, baseType: !10, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !94, file: !1, line: 17, baseType: !10, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !94, file: !1, line: 17, baseType: !10, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !94, file: !1, line: 17, baseType: !10, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !94, file: !1, line: 17, baseType: !10, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !94, file: !1, line: 17, baseType: !10, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !94, file: !1, line: 17, baseType: !10, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !94, file: !1, line: 17, baseType: !10, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !94, file: !1, line: 17, baseType: !10, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !94, file: !1, line: 17, baseType: !10, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!112 = !{!13, !113, !114}
!113 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!114 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "prevCameraPos", scope: !87, file: !88, line: 30, baseType: !25, size: 96, align: 32, offset: 640)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_padding1", scope: !87, file: !88, line: 31, baseType: !10, size: 32, align: 32, offset: 736)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "prevInvViewProjMtx", scope: !87, file: !88, line: 32, baseType: !93, size: 512, align: 32, offset: 768)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "viewMtx", scope: !87, file: !88, line: 33, baseType: !93, size: 512, align: 32, offset: 1280)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "viewProjMtx", scope: !87, file: !88, line: 34, baseType: !93, size: 512, align: 32, offset: 1792)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "prevViewProjMtx", scope: !87, file: !88, line: 35, baseType: !93, size: 512, align: 32, offset: 2304)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "resolution", scope: !87, file: !88, line: 36, baseType: !25, size: 96, align: 32, offset: 2816)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !87, file: !88, line: 37, baseType: !10, size: 32, align: 32, offset: 2912)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !87, file: !88, line: 38, baseType: !10, size: 32, align: 32, offset: 2944)
!124 = !DIGlobalVariable(name: "linearClamp", linkageName: "\01?linearClamp@@3USamplerState@@A", scope: !0, file: !1, line: 19, type: !125, isLocal: false, isDefinition: true)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 19, size: 32, align: 32, elements: !2)
!126 = !{i32 2, !"Dwarf Version", i32 4}
!127 = !{i32 2, !"Debug Info Version", i32 3}
!128 = !{!"dxcoob 1.7.2308.16 (52da17e29)"}
!129 = !{!"shaders\5CTemporalReprojectionCS.hlsl", !"#include \22ParticleConfig.h\22\0D\0A\0D\0ATexture2D<float4> CurrentFrame : register(t0);\0D\0ATexture2D<float4> VelocityBuffer : register(t1);\0D\0ATexture2D<float4> HistoryBuffer : register(t2);\0D\0ATexture2D<float4> PositionBuffer : register(t3);\0D\0ATexture2D<float4> NormalBuffer : register(t4);\0D\0ATexture2D<float4> PrevPositionBuffer : register(t5);\0D\0ATexture2D<float4> PrevNormalBuffer : register(t6);\0D\0ATexture2D<float> HistoryM1Prev : register(t7);\0D\0ATexture2D<float> HistoryM2Prev : register(t8);\0D\0A\0D\0ARWTexture2D<float4> ResultTexture : register(u0);\0D\0ARWTexture2D<float> HistoryM1Out : register(u1);\0D\0ARWTexture2D<float> HistoryM2Out : register(u2);\0D\0A\0D\0AConstantBuffer<ConstantBufferData> ConstantData : register(b0);\0D\0A\0D\0ASamplerState linearClamp : register(s0);\0D\0A\0D\0Afloat Luma(float3 c)\0D\0A{\0D\0A    return dot(c, float3(0.299, 0.587, 0.114));\0D\0A}\0D\0A\0D\0Afloat LinearDepthFromPos(float3 worldPos)\0D\0A{\0D\0A    // View-space Z from position (positive forward depends on your convention).\0D\0A    // Here we compute |camera->point| as a simple linear depth proxy:\0D\0A    return distance(worldPos, ConstantData.cameraPos);\0D\0A}\0D\0A\0D\0A[numthreads(32, 32, 1)]\0D\0Avoid main( uint3 DTid : SV_DispatchThreadID )\0D\0A{\0D\0A    uint2 px = DTid.xy;\0D\0A    if (px.x >= uint(ConstantData.resolution.x) || px.y >= uint(ConstantData.resolution.y))\0D\0A        return;\0D\0A    \0D\0A    float2 uv = (float2(px) + 0.5) / ConstantData.resolution.xy;\0D\0A    float3 ccurr = CurrentFrame.Load(int3(px, 0)).rgb;\0D\0A    float3 ncurr = normalize(NormalBuffer.Load(float3(px, 0)).rgb);\0D\0A    float3 pcurr = PositionBuffer.Load(float3(px, 0)).rgb;\0D\0A    float zcurr = LinearDepthFromPos(pcurr);\0D\0A    \0D\0A    float2 vel = VelocityBuffer.Load(int3(px, 0)).xy / ConstantData.resolution.xy;\0D\0A    float2 uvPrev = uv + vel;\0D\0A    \0D\0A    bool valid = all(uvPrev > 0.0) && all(uvPrev <= 1.0);\0D\0A    \0D\0A    float3 cprev = 0;\0D\0A    float m1prev = 0;\0D\0A    float m2prev = 0;\0D\0A    \0D\0A    if (valid)\0D\0A    {\0D\0A        cprev = HistoryBuffer.SampleLevel(linearClamp, uvPrev, 0).rgb;\0D\0A        m1prev = HistoryM1Prev.SampleLevel(linearClamp, uvPrev, 0).r;\0D\0A        m2prev = HistoryM2Prev.SampleLevel(linearClamp, uvPrev, 0).r;\0D\0A        float3 nprev = normalize(PrevNormalBuffer.SampleLevel(linearClamp, uvPrev, 0).rgb);\0D\0A        float3 pprev = PrevPositionBuffer.SampleLevel(linearClamp, uvPrev, 0).rgb;\0D\0A        float zprev = LinearDepthFromPos(pprev);\0D\0A        float ndot = dot(ncurr, nprev);\0D\0A        float dz = abs(zcurr - zprev);\0D\0A        float dzThr = max(0.002 * zcurr, 0.002 * 0.5);\0D\0A        \0D\0A        valid = valid && (ndot > 0.9) && (dz < dzThr);\0D\0A\0D\0A    }\0D\0A\0D\0A    float Ymin = +1e9, Ymax = -1e9, sum = 0, sum2 = 0;\0D\0A    \0D\0A    [unroll]\0D\0A    for (int oy = -1; oy <= 1; ++oy)\0D\0A    {\0D\0A        [unroll]\0D\0A        for (int ox = -1; ox <= 1; ++ox)\0D\0A        {\0D\0A            int2 q = clamp(int2(px) + int2(ox, oy), int2(0, 0), int2(ConstantData.resolution.xy) - 1);\0D\0A            float3 Cn = CurrentFrame.Load(int3(q, 0)).rgb;\0D\0A            float y = Luma(Cn);\0D\0A            Ymin = min(Ymin, y);\0D\0A            Ymax = max(Ymax, y);\0D\0A            sum += y;\0D\0A            sum2 += y * y;\0D\0A        }\0D\0A    }\0D\0A    \0D\0A    float mean = sum / 9.0;\0D\0A    float var = max(sum2 / 9.0 - mean * mean, 0);\0D\0A    float pad = 1.0 * sqrt(var); // tune 0.5\962.0\0D\0A    Ymin -= pad;\0D\0A    Ymax += pad;\0D\0A    \0D\0A    // Clamp history luminance into current range\0D\0A    float3 Chist = cprev;\0D\0A    if (valid)\0D\0A    {\0D\0A        float Yh = Luma(Chist);\0D\0A        float Yhc = clamp(Yh, Ymin, Ymax);\0D\0A        float s = (Yh > 1e-4) ? (Yhc / Yh) : 1.0;\0D\0A        Chist *= s;\0D\0A    }\0D\0A    \0D\0A    float Ycurr = Luma(ccurr);\0D\0A    float3 Cout;\0D\0A    float M1, M2;\0D\0A    \0D\0A    if (!valid)\0D\0A    {\0D\0A        Cout = ccurr;\0D\0A        M1 = Ycurr;\0D\0A        M2 = Ycurr * Ycurr;\0D\0A    }\0D\0A    else\0D\0A    {\0D\0A        Cout = lerp(ccurr, Chist, 1 - 0.15);\0D\0A        M1 = lerp(Ycurr, m1prev, 1 - 0.15);\0D\0A        M2 = lerp(Ycurr * Ycurr, m2prev, 1 - 0.15);\0D\0A    }\0D\0A    ResultTexture[px] = float4(Cout, 1);\0D\0A    HistoryM1Out[px] = M1;\0D\0A    HistoryM2Out[px] = M2;\0D\0A}"}
!130 = !{!"shaders\5CParticleConfig.h", !"#define NUM_PARTICLES (32*6)\0D\0A\0D\0A#ifdef IS_CPU\0D\0Atypedef ni::Float3 float3;\0D\0Atypedef ni::Float4x4 float4x4;\0D\0Atypedef uint32_t uint;\0D\0A#endif\0D\0A\0D\0Astruct ParticleData\0D\0A{\0D\0A\09float3 position;\0D\0A\09float3 velocity;\0D\0A\09float3 acceleration;\0D\0A\09float3 albedo;\0D\0A\09float3 prevPosition;\0D\0A\09float radius;\0D\0A\09float elasticity;\0D\0A\09float friction;\0D\0A\09float reflection;\0D\0A\09float emissive;\0D\0A\09uint id;\0D\0A\09uint dynamic;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferData\0D\0A{\0D\0A\09float3 cameraPos;\0D\0A\09float _padding0;\0D\0A\09float4x4 invViewProjMtx;\0D\0A\09float3 prevCameraPos;\0D\0A\09float _padding1;\0D\0A\09float4x4 prevInvViewProjMtx;\0D\0A\09float4x4 viewMtx;\0D\0A\09float4x4 viewProjMtx;\0D\0A\09float4x4 prevViewProjMtx;\0D\0A\09float3 resolution;\0D\0A\09float time;\0D\0A\09float frame;\0D\0A};"}
!131 = !{!"shaders\5CTemporalReprojectionCS.hlsl"}
!132 = !{!"-E", !"main", !"-T", !"cs_6_0", !"/Fo", !"D:\5Cdev2\5Cfp2025\5C\5Cbin\5CDebug\5CTemporalReprojectionCS.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!133 = !{i32 1, i32 0}
!134 = !{i32 1, i32 7}
!135 = !{!"cs", i32 6, i32 0}
!136 = !{!137, !148, !152, !154}
!137 = !{!138, !140, !141, !142, !143, !144, !145, !146, !147}
!138 = !{i32 0, %"class.Texture2D<vector<float, 4> >"* undef, !"CurrentFrame", i32 0, i32 0, i32 1, i32 2, i32 0, !139}
!139 = !{i32 0, i32 9}
!140 = !{i32 1, %"class.Texture2D<vector<float, 4> >"* undef, !"VelocityBuffer", i32 0, i32 1, i32 1, i32 2, i32 0, !139}
!141 = !{i32 2, %"class.Texture2D<vector<float, 4> >"* undef, !"HistoryBuffer", i32 0, i32 2, i32 1, i32 2, i32 0, !139}
!142 = !{i32 3, %"class.Texture2D<vector<float, 4> >"* undef, !"PositionBuffer", i32 0, i32 3, i32 1, i32 2, i32 0, !139}
!143 = !{i32 4, %"class.Texture2D<vector<float, 4> >"* undef, !"NormalBuffer", i32 0, i32 4, i32 1, i32 2, i32 0, !139}
!144 = !{i32 5, %"class.Texture2D<vector<float, 4> >"* undef, !"PrevPositionBuffer", i32 0, i32 5, i32 1, i32 2, i32 0, !139}
!145 = !{i32 6, %"class.Texture2D<vector<float, 4> >"* undef, !"PrevNormalBuffer", i32 0, i32 6, i32 1, i32 2, i32 0, !139}
!146 = !{i32 7, %"class.Texture2D<float>"* undef, !"HistoryM1Prev", i32 0, i32 7, i32 1, i32 2, i32 0, !139}
!147 = !{i32 8, %"class.Texture2D<float>"* undef, !"HistoryM2Prev", i32 0, i32 8, i32 1, i32 2, i32 0, !139}
!148 = !{!149, !150, !151}
!149 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* undef, !"ResultTexture", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !139}
!150 = !{i32 1, %"class.RWTexture2D<float>"* undef, !"HistoryM1Out", i32 0, i32 1, i32 1, i32 2, i1 false, i1 false, i1 false, !139}
!151 = !{i32 2, %"class.RWTexture2D<float>"* undef, !"HistoryM2Out", i32 0, i32 2, i32 1, i32 2, i1 false, i1 false, i1 false, !139}
!152 = !{!153}
!153 = !{i32 0, %hostlayout.ConstantData* undef, !"ConstantData", i32 0, i32 0, i32 1, i32 372, null}
!154 = !{!155}
!155 = !{i32 0, %struct.SamplerState* undef, !"linearClamp", i32 0, i32 0, i32 1, i32 0, null}
!156 = !{i32 0, %hostlayout.struct.ConstantBufferData undef, !157, %hostlayout.ConstantData undef, !171}
!157 = !{i32 372, !158, !159, !160, !162, !163, !164, !165, !166, !167, !168, !169, !170}
!158 = !{i32 6, !"cameraPos", i32 3, i32 0, i32 7, i32 9}
!159 = !{i32 6, !"_padding0", i32 3, i32 12, i32 7, i32 9}
!160 = !{i32 6, !"invViewProjMtx", i32 2, !161, i32 3, i32 16, i32 7, i32 9}
!161 = !{i32 4, i32 4, i32 2}
!162 = !{i32 6, !"prevCameraPos", i32 3, i32 80, i32 7, i32 9}
!163 = !{i32 6, !"_padding1", i32 3, i32 92, i32 7, i32 9}
!164 = !{i32 6, !"prevInvViewProjMtx", i32 2, !161, i32 3, i32 96, i32 7, i32 9}
!165 = !{i32 6, !"viewMtx", i32 2, !161, i32 3, i32 160, i32 7, i32 9}
!166 = !{i32 6, !"viewProjMtx", i32 2, !161, i32 3, i32 224, i32 7, i32 9}
!167 = !{i32 6, !"prevViewProjMtx", i32 2, !161, i32 3, i32 288, i32 7, i32 9}
!168 = !{i32 6, !"resolution", i32 3, i32 352, i32 7, i32 9}
!169 = !{i32 6, !"time", i32 3, i32 364, i32 7, i32 9}
!170 = !{i32 6, !"frame", i32 3, i32 368, i32 7, i32 9}
!171 = !{i32 372, !172}
!172 = !{i32 6, !"ConstantData", i32 3, i32 0}
!173 = !{i32 1, void ()* @main, !174}
!174 = !{!175}
!175 = !{i32 0, !2, !2}
!176 = !{void ()* @main, !"main", null, !136, !177}
!177 = !{i32 0, i64 1, i32 4, !178}
!178 = !{i32 32, i32 32, i32 1}
!179 = !DILocation(line: 58, column: 18, scope: !180)
!180 = distinct !DILexicalBlock(scope: !181, file: !1, line: 56, column: 5)
!181 = distinct !DILexicalBlock(scope: !48, file: !1, line: 55, column: 9)
!182 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "DTid", arg: 1, scope: !48, file: !1, line: 34, type: !51)
!183 = !DIExpression(DW_OP_bit_piece, 0, 32)
!184 = !DILocation(line: 34, column: 18, scope: !48)
!185 = !DIExpression(DW_OP_bit_piece, 32, 32)
!186 = !DILocation(line: 36, column: 11, scope: !48)
!187 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "px", scope: !48, file: !1, line: 36, type: !188)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 36, baseType: !189)
!189 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 36, size: 64, align: 32, elements: !190, templateParams: !193)
!190 = !{!191, !192}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !189, file: !1, line: 36, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !189, file: !1, line: 36, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!193 = !{!58, !14}
!194 = !DILocation(line: 37, column: 22, scope: !195)
!195 = distinct !DILexicalBlock(scope: !48, file: !1, line: 37, column: 9)
!196 = !DILocation(line: 37, column: 14, scope: !195)
!197 = !DILocation(line: 37, column: 49, scope: !195)
!198 = !DILocation(line: 37, column: 65, scope: !195)
!199 = !DILocation(line: 37, column: 57, scope: !195)
!200 = !DILocation(line: 37, column: 9, scope: !48)
!201 = !DILocation(line: 38, column: 9, scope: !195)
!202 = !DILocation(line: 40, column: 18, scope: !48)
!203 = !DILocation(line: 40, column: 29, scope: !48)
!204 = !DILocation(line: 40, column: 38, scope: !48)
!205 = !DILocation(line: 40, column: 36, scope: !48)
!206 = !DILocation(line: 40, column: 12, scope: !48)
!207 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uv", scope: !48, file: !1, line: 40, type: !6)
!208 = !DILocation(line: 41, column: 20, scope: !48)
!209 = !DILocation(line: 41, column: 12, scope: !48)
!210 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ccurr", scope: !48, file: !1, line: 41, type: !25)
!211 = !DIExpression(DW_OP_bit_piece, 64, 32)
!212 = !DILocation(line: 42, column: 54, scope: !48)
!213 = !DILocation(line: 42, column: 48, scope: !48)
!214 = !DILocation(line: 42, column: 30, scope: !48)
!215 = !DILocation(line: 42, column: 20, scope: !48)
!216 = !DILocation(line: 42, column: 12, scope: !48)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncurr", scope: !48, file: !1, line: 42, type: !25)
!218 = !DILocation(line: 43, column: 46, scope: !48)
!219 = !DILocation(line: 43, column: 40, scope: !48)
!220 = !DILocation(line: 43, column: 20, scope: !48)
!221 = !DILocation(line: 43, column: 12, scope: !48)
!222 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pcurr", scope: !48, file: !1, line: 43, type: !25)
!223 = !DILocation(line: 44, column: 19, scope: !48)
!224 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "worldPos", arg: 1, scope: !59, file: !1, line: 26, type: !25)
!225 = !DILocation(line: 26, column: 33, scope: !59, inlinedAt: !226)
!226 = distinct !DILocation(line: 44, column: 19, scope: !48)
!227 = !DILocation(line: 30, column: 44, scope: !59, inlinedAt: !226)
!228 = !DILocation(line: 30, column: 12, scope: !59, inlinedAt: !226)
!229 = !DILocation(line: 30, column: 5, scope: !59, inlinedAt: !226)
!230 = !DILocation(line: 44, column: 11, scope: !48)
!231 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zcurr", scope: !48, file: !1, line: 44, type: !10)
!232 = !DIExpression()
!233 = !DILocation(line: 46, column: 18, scope: !48)
!234 = !DILocation(line: 46, column: 56, scope: !48)
!235 = !DILocation(line: 46, column: 54, scope: !48)
!236 = !DILocation(line: 46, column: 12, scope: !48)
!237 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vel", scope: !48, file: !1, line: 46, type: !6)
!238 = !DILocation(line: 47, column: 24, scope: !48)
!239 = !DILocation(line: 47, column: 12, scope: !48)
!240 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uvPrev", scope: !48, file: !1, line: 47, type: !6)
!241 = !DILocation(line: 49, column: 29, scope: !48)
!242 = !DILocation(line: 49, column: 18, scope: !48)
!243 = !DILocation(line: 49, column: 36, scope: !48)
!244 = !DILocation(line: 49, column: 50, scope: !48)
!245 = !DILocation(line: 49, column: 39, scope: !48)
!246 = !DILocation(line: 49, column: 10, scope: !48)
!247 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "valid", scope: !48, file: !1, line: 49, type: !248)
!248 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!249 = !DILocation(line: 51, column: 12, scope: !48)
!250 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cprev", scope: !48, file: !1, line: 51, type: !25)
!251 = !DILocation(line: 52, column: 11, scope: !48)
!252 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m1prev", scope: !48, file: !1, line: 52, type: !10)
