#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 26d3e6de6c17775ff2ef5366d9570ae4.pdb
; shader hash: 26d3e6de6c17775ff2ef5366d9570ae4
;
; Pipeline Runtime Information: 
;
; Compute Shader
; NumThreads=(32,32,1)
;
;
; Buffer Definitions:
;
; cbuffer ConstantData
; {
;
;   struct hostlayout.ConstantData
;   {
;
;       struct hostlayout.struct.ConstantBufferData
;       {
;
;           float3 cameraPos;                         ; Offset:    0
;           float _padding0;                          ; Offset:   12
;           column_major float4x4 invViewProjMtx;     ; Offset:   16
;           float3 prevCameraPos;                     ; Offset:   80
;           float _padding1;                          ; Offset:   92
;           column_major float4x4 prevInvViewProjMtx; ; Offset:   96
;           column_major float4x4 viewMtx;            ; Offset:  160
;           column_major float4x4 viewProjMtx;        ; Offset:  224
;           column_major float4x4 prevViewProjMtx;    ; Offset:  288
;           float3 resolution;                        ; Offset:  352
;           float time;                               ; Offset:  364

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.7.2308.16 (52da17e29)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !47, globals: !62)
!1 = !DIFile(filename: "shaders\5CTemporalReprojectionCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !6, !16, !23, !31, !40}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 31, baseType: !5)
!5 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 37, baseType: !7)
!7 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 37, size: 64, align: 32, elements: !8, templateParams: !12)
!8 = !{!9, !11}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !7, file: !1, line: 37, baseType: !10, size: 32, align: 32, flags: DIFlagPublic)
!10 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !7, file: !1, line: 37, baseType: !10, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !10)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 80, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 80, size: 64, align: 32, elements: !18, templateParams: !21)
!18 = !{!19, !20}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, line: 80, baseType: !15, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, line: 80, baseType: !15, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !{!22, !14}
!22 = !DITemplateTypeParameter(name: "element", type: !15)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "int3", file: !1, line: 81, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 3>", file: !1, line: 81, size: 96, align: 32, elements: !25, templateParams: !29)
!25 = !{!26, !27, !28}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !24, file: !1, line: 81, baseType: !15, size: 32, align: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !24, file: !1, line: 81, baseType: !15, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !24, file: !1, line: 81, baseType: !15, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!29 = !{!22, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 34, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 34, size: 128, align: 32, elements: !33, templateParams: !38)
!33 = !{!34, !35, !36, !37}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !32, file: !1, line: 34, baseType: !10, size: 32, align: 32, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !32, file: !1, line: 34, baseType: !10, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !32, file: !1, line: 34, baseType: !10, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !32, file: !1, line: 34, baseType: !10, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!38 = !{!13, !39}
!39 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 38, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 38, size: 96, align: 32, elements: !42, templateParams: !46)
!42 = !{!43, !44, !45}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !41, file: !1, line: 38, baseType: !10, size: 32, align: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !41, file: !1, line: 38, baseType: !10, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !41, file: !1, line: 38, baseType: !10, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!46 = !{!13, !30}
!47 = !{!48, !59}
!48 = !DISubprogram(name: "main", scope: !1, file: !1, line: 28, type: !49, isLocal: false, isDefinition: true, scopeLine: 29, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!49 = !DISubroutineType(types: !50)
!50 = !{null, !51}
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !52)
!52 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !53, templateParams: !57)
!53 = !{!54, !55, !56}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !52, file: !1, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !52, file: !1, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !52, file: !1, baseType: !5, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!57 = !{!58, !30}
!58 = !DITemplateTypeParameter(name: "element", type: !5)
!59 = !DISubprogram(name: "Luma", linkageName: "\01?Luma@@YAMV?$vector@M$02@@@Z", scope: !1, file: !1, line: 22, type: !60, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: false)
!60 = !DISubroutineType(types: !61)
!61 = !{!10, !40}
!62 = !{!63, !65, !66, !67, !71, !72, !73, !74, !75, !76, !77, !80, !81, !83, !85, !86, !127, !129}
!63 = !DIGlobalVariable(name: "zt", scope: !48, file: !1, line: 64, type: !64, isLocal: true, isDefinition: true)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!65 = !DIGlobalVariable(name: "nt", scope: !48, file: !1, line: 67, type: !64, isLocal: true, isDefinition: true)
!66 = !DIGlobalVariable(name: "blend", scope: !48, file: !1, line: 118, type: !64, isLocal: true, isDefinition: true)
!67 = !DIGlobalVariable(name: "CurrentFrame", linkageName: "\01?CurrentFrame@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 3, type: !68, isLocal: false, isDefinition: true)
!68 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 3, size: 160, align: 32, elements: !2, templateParams: !69)
!69 = !{!70}
!70 = !DITemplateTypeParameter(name: "element", type: !32)
!71 = !DIGlobalVariable(name: "VelocityBuffer", linkageName: "\01?VelocityBuffer@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 4, type: !68, isLocal: false, isDefinition: true)
!72 = !DIGlobalVariable(name: "HistoryBuffer", linkageName: "\01?HistoryBuffer@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 5, type: !68, isLocal: false, isDefinition: true)
!73 = !DIGlobalVariable(name: "PositionBuffer", linkageName: "\01?PositionBuffer@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 6, type: !68, isLocal: false, isDefinition: true)
!74 = !DIGlobalVariable(name: "NormalBuffer", linkageName: "\01?NormalBuffer@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 7, type: !68, isLocal: false, isDefinition: true)
!75 = !DIGlobalVariable(name: "PrevPositionBuffer", linkageName: "\01?PrevPositionBuffer@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 8, type: !68, isLocal: false, isDefinition: true)
!76 = !DIGlobalVariable(name: "PrevNormalBuffer", linkageName: "\01?PrevNormalBuffer@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 9, type: !68, isLocal: false, isDefinition: true)
!77 = !DIGlobalVariable(name: "HistoryM1Prev", linkageName: "\01?HistoryM1Prev@@3V?$Texture2D@M@@A", scope: !0, file: !1, line: 10, type: !78, isLocal: false, isDefinition: true)
!78 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<float>", file: !1, line: 10, size: 64, align: 32, elements: !2, templateParams: !79)
!79 = !{!13}
!80 = !DIGlobalVariable(name: "HistoryM2Prev", linkageName: "\01?HistoryM2Prev@@3V?$Texture2D@M@@A", scope: !0, file: !1, line: 11, type: !78, isLocal: false, isDefinition: true)
!81 = !DIGlobalVariable(name: "ResultTexture", linkageName: "\01?ResultTexture@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 13, type: !82, isLocal: false, isDefinition: true)
!82 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 13, size: 128, align: 32, elements: !2, templateParams: !69)
!83 = !DIGlobalVariable(name: "HistoryM1Out", linkageName: "\01?HistoryM1Out@@3V?$RWTexture2D@M@@A", scope: !0, file: !1, line: 14, type: !84, isLocal: false, isDefinition: true)
!84 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<float>", file: !1, line: 14, size: 32, align: 32, elements: !2, templateParams: !79)
!85 = !DIGlobalVariable(name: "HistoryM2Out", linkageName: "\01?HistoryM2Out@@3V?$RWTexture2D@M@@A", scope: !0, file: !1, line: 15, type: !84, isLocal: false, isDefinition: true)
!86 = !DIGlobalVariable(name: "ConstantData", linkageName: "\01?ConstantData@@3U?$ConstantBuffer@UConstantBufferData@@@@A", scope: !0, file: !1, line: 17, type: !87, isLocal: false, isDefinition: true)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferData>", file: !1, line: 17, size: 32, align: 32, elements: !2, templateParams: !88)
!88 = !{!89}
!89 = !DITemplateTypeParameter(name: "T", type: !90)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferData", file: !91, line: 25, size: 2976, align: 32, elements: !92)
!91 = !DIFile(filename: "shaders/ParticleConfig.h", directory: "")
!92 = !{!93, !94, !95, !118, !119, !120, !121, !122, !123, !124, !125, !126}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "cameraPos", scope: !90, file: !91, line: 27, baseType: !40, size: 96, align: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_padding0", scope: !90, file: !91, line: 28, baseType: !10, size: 32, align: 32, offset: 96)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "invViewProjMtx", scope: !90, file: !91, line: 29, baseType: !96, size: 512, align: 32, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 17, baseType: !97)
!97 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 17, size: 512, align: 32, elements: !98, templateParams: !115)
!98 = !{!99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !97, file: !1, line: 17, baseType: !10, size: 32, align: 32, flags: DIFlagPublic)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !97, file: !1, line: 17, baseType: !10, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !97, file: !1, line: 17, baseType: !10, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !97, file: !1, line: 17, baseType: !10, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !97, file: !1, line: 17, baseType: !10, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !97, file: !1, line: 17, baseType: !10, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !97, file: !1, line: 17, baseType: !10, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !97, file: !1, line: 17, baseType: !10, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !97, file: !1, line: 17, baseType: !10, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !97, file: !1, line: 17, baseType: !10, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !97, file: !1, line: 17, baseType: !10, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !97, file: !1, line: 17, baseType: !10, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !97, file: !1, line: 17, baseType: !10, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !97, file: !1, line: 17, baseType: !10, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !97, file: !1, line: 17, baseType: !10, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !97, file: !1, line: 17, baseType: !10, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!115 = !{!13, !116, !117}
!116 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!117 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "prevCameraPos", scope: !90, file: !91, line: 30, baseType: !40, size: 96, align: 32, offset: 640)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_padding1", scope: !90, file: !91, line: 31, baseType: !10, size: 32, align: 32, offset: 736)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "prevInvViewProjMtx", scope: !90, file: !91, line: 32, baseType: !96, size: 512, align: 32, offset: 768)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "viewMtx", scope: !90, file: !91, line: 33, baseType: !96, size: 512, align: 32, offset: 1280)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "viewProjMtx", scope: !90, file: !91, line: 34, baseType: !96, size: 512, align: 32, offset: 1792)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "prevViewProjMtx", scope: !90, file: !91, line: 35, baseType: !96, size: 512, align: 32, offset: 2304)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "resolution", scope: !90, file: !91, line: 36, baseType: !40, size: 96, align: 32, offset: 2816)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !90, file: !91, line: 37, baseType: !10, size: 32, align: 32, offset: 2912)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !90, file: !91, line: 38, baseType: !10, size: 32, align: 32, offset: 2944)
!127 = !DIGlobalVariable(name: "linearClamp", linkageName: "\01?linearClamp@@3USamplerState@@A", scope: !0, file: !1, line: 19, type: !128, isLocal: false, isDefinition: true)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 19, size: 32, align: 32, elements: !2)
!129 = !DIGlobalVariable(name: "pointClamp", linkageName: "\01?pointClamp@@3USamplerState@@A", scope: !0, file: !1, line: 20, type: !128, isLocal: false, isDefinition: true)
!130 = !{i32 2, !"Dwarf Version", i32 4}
!131 = !{i32 2, !"Debug Info Version", i32 3}
!132 = !{!"dxcoob 1.7.2308.16 (52da17e29)"}
!133 = !{!"shaders\5CTemporalReprojectionCS.hlsl", !"#include \22ParticleConfig.h\22\0D\0A\0D\0ATexture2D<float4> CurrentFrame : register(t0);\0D\0ATexture2D<float4> VelocityBuffer : register(t1);\0D\0ATexture2D<float4> HistoryBuffer : register(t2);\0D\0ATexture2D<float4> PositionBuffer : register(t3);\0D\0ATexture2D<float4> NormalBuffer : register(t4);\0D\0ATexture2D<float4> PrevPositionBuffer : register(t5);\0D\0ATexture2D<float4> PrevNormalBuffer : register(t6);\0D\0ATexture2D<float> HistoryM1Prev : register(t7);\0D\0ATexture2D<float> HistoryM2Prev : register(t8);\0D\0A\0D\0ARWTexture2D<float4> ResultTexture : register(u0);\0D\0ARWTexture2D<float> HistoryM1Out : register(u1);\0D\0ARWTexture2D<float> HistoryM2Out : register(u2);\0D\0A\0D\0AConstantBuffer<ConstantBufferData> ConstantData : register(b0);\0D\0A\0D\0ASamplerState linearClamp : register(s0);\0D\0ASamplerState pointClamp : register(s1);\0D\0A\0D\0Afloat Luma(float3 c)\0D\0A{\0D\0A    return dot(c, float3(0.299, 0.587, 0.114));\0D\0A}\0D\0A\0D\0A[numthreads(32, 32, 1)]\0D\0Avoid main( uint3 DTid : SV_DispatchThreadID )\0D\0A{\0D\0A    uint2 px = DTid.xy;\0D\0A    if (px.x >= uint(ConstantData.resolution.x) || px.y >= uint(ConstantData.resolution.y))\0D\0A        return;\0D\0A    \0D\0A    float4 positionAndId = PositionBuffer[px];\0D\0A    float4 currentFrameAndDepth = CurrentFrame[px];\0D\0A    \0D\0A    float2 uv = (float2(px) + 0.5) / ConstantData.resolution.xy;\0D\0A    float3 ccurr = currentFrameAndDepth.rgb;\0D\0A    float3 ncurr = normalize(NormalBuffer[px].rgb);\0D\0A    float3 pcurr = positionAndId.xyz;\0D\0A    uint idcurr = uint(positionAndId.w);\0D\0A    float zcurr = currentFrameAndDepth.w;\0D\0A    float2 vel = VelocityBuffer[px].xy;\0D\0A    float2 uvPrev = uv + vel;\0D\0A    \0D\0A    bool valid = all(uvPrev > 0.0) && all(uvPrev <= 1.0) && idcurr > 0;\0D\0A    \0D\0A    float3 cprev = 0;\0D\0A    float m1prev = 0;\0D\0A    float m2prev = 0;\0D\0A    \0D\0A    if (valid)\0D\0A    {\0D\0A        float4 prevFrameAndDepth = HistoryBuffer.SampleLevel(linearClamp, uvPrev, 0);\0D\0A        cprev = prevFrameAndDepth.rgb;\0D\0A        m1prev = HistoryM1Prev.SampleLevel(linearClamp, uvPrev, 0).r;\0D\0A        m2prev = HistoryM2Prev.SampleLevel(linearClamp, uvPrev, 0).r;\0D\0A        float3 nprev = normalize(PrevNormalBuffer.SampleLevel(linearClamp, uvPrev, 0).rgb);\0D\0A        float3 pprev = PrevPositionBuffer.SampleLevel(linearClamp, uvPrev, 0).rgb;\0D\0A        uint idprev = uint(PrevPositionBuffer.SampleLevel(pointClamp, uvPrev, 0).w);\0D\0A        float zprev = prevFrameAndDepth.w;\0D\0A        float ndot = dot(ncurr, nprev);\0D\0A        float dz = abs(zcurr - zprev);\0D\0A        const float zt = 0.004;\0D\0A        float dzThr = max(zt * zcurr, zt * 0.5);\0D\0A        \0D\0A        const float nt = 0.9;\0D\0A        valid = valid && (ndot > nt) && (dz < dzThr) && idprev == idcurr;\0D\0A\0D\0A    }\0D\0A\0D\0A    float Ymin = +1e9, Ymax = -1e9, sum = 0, sum2 = 0;\0D\0A    \0D\0A    [unroll]\0D\0A    for (int oy = -1; oy <= 1; ++oy)\0D\0A    {\0D\0A        [unroll]\0D\0A        for (int ox = -1; ox <= 1; ++ox)\0D\0A        {\0D\0A            int2 q = clamp(int2(px) + int2(ox, oy), int2(0, 0), int2(ConstantData.resolution.xy) - 1);\0D\0A            float3 Cn = CurrentFrame.Load(int3(q, 0)).rgb;\0D\0A            float y = Luma(Cn);\0D\0A            Ymin = min(Ymin, y);\0D\0A            Ymax = max(Ymax, y);\0D\0A            sum += y;\0D\0A            sum2 += y * y;\0D\0A        }\0D\0A    }\0D\0A    \0D\0A    float mean = sum / 9.0;\0D\0A    float var = max(sum2 / 9.0 - mean * mean, 0);\0D\0A    float pad = 1.0 * sqrt(var); // tune 0.5\962.0\0D\0A    Ymin -= pad;\0D\0A    Ymax += pad;\0D\0A    \0D\0A    // Clamp history luminance into current range\0D\0A    float3 Chist = cprev;\0D\0A    if (valid)\0D\0A    {\0D\0A        float Yh = Luma(Chist);\0D\0A        float Yhc = clamp(Yh, Ymin, Ymax);\0D\0A        float s = (Yh > 1e-4) ? (Yhc / Yh) : 1.0;\0D\0A        Chist *= s;\0D\0A    }\0D\0A    \0D\0A    float Ycurr = Luma(ccurr);\0D\0A    float3 Cout;\0D\0A    float M1, M2;\0D\0A    \0D\0A    if (!valid)\0D\0A    {\0D\0A        Cout = ccurr;\0D\0A        M1 = Ycurr;\0D\0A        M2 = Ycurr * Ycurr;\0D\0A    }\0D\0A    else\0D\0A    {\0D\0A        const float blend = 0.2;\0D\0A        Cout = lerp(ccurr, Chist, 1 - blend);\0D\0A        M1 = lerp(Ycurr, m1prev, 1 - blend);\0D\0A        M2 = lerp(Ycurr * Ycurr, m2prev, 1 - blend);\0D\0A    }\0D\0A    ResultTexture[px] = float4(Cout, zcurr);\0D\0A    HistoryM1Out[px] = M1;\0D\0A    HistoryM2Out[px] = M2;\0D\0A}"}
!134 = !{!"shaders\5CParticleConfig.h", !"#define NUM_PARTICLES (32*2)\0D\0A\0D\0A#ifdef IS_CPU\0D\0Atypedef ni::Float3 float3;\0D\0Atypedef ni::Float4x4 float4x4;\0D\0Atypedef uint32_t uint;\0D\0A#endif\0D\0A\0D\0Astruct ParticleData\0D\0A{\0D\0A\09float3 position;\0D\0A\09float3 prevPosition;\0D\0A\09float3 velocity;\0D\0A\09float3 acceleration;\0D\0A\09float3 albedo;\0D\0A\09float radius;\0D\0A\09float elasticity;\0D\0A\09float friction;\0D\0A\09float reflection;\0D\0A\09float emissive;\0D\0A\09uint id;\0D\0A\09uint dynamic;\0D\0A};\0D\0A\0D\0Astruct ConstantBufferData\0D\0A{\0D\0A\09float3 cameraPos;\0D\0A\09float _padding0;\0D\0A\09float4x4 invViewProjMtx;\0D\0A\09float3 prevCameraPos;\0D\0A\09float _padding1;\0D\0A\09float4x4 prevInvViewProjMtx;\0D\0A\09float4x4 viewMtx;\0D\0A\09float4x4 viewProjMtx;\0D\0A\09float4x4 prevViewProjMtx;\0D\0A\09float3 resolution;\0D\0A\09float time;\0D\0A\09float frame;\0D\0A};\0D\0A\0D\0A#ifndef IS_CPU\0D\0Afloat toRad(float d) { return 3.14159265359f * d / 180.0f; }\0D\0A#endif"}
!135 = !{!"shaders\5CTemporalReprojectionCS.hlsl"}
!136 = !{!"-E", !"main", !"-T", !"cs_6_0", !"/Fo", !"D:\5Cdev2\5Cfp2025\5C\5Cbin\5CDebug\5CTemporalReprojectionCS.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!137 = !{i32 1, i32 0}
!138 = !{i32 1, i32 7}
!139 = !{!"cs", i32 6, i32 0}
!140 = !{!141, !152, !156, !158}
!141 = !{!142, !144, !145, !146, !147, !148, !149, !150, !151}
!142 = !{i32 0, %"class.Texture2D<vector<float, 4> >"* undef, !"CurrentFrame", i32 0, i32 0, i32 1, i32 2, i32 0, !143}
!143 = !{i32 0, i32 9}
!144 = !{i32 1, %"class.Texture2D<vector<float, 4> >"* undef, !"VelocityBuffer", i32 0, i32 1, i32 1, i32 2, i32 0, !143}
!145 = !{i32 2, %"class.Texture2D<vector<float, 4> >"* undef, !"HistoryBuffer", i32 0, i32 2, i32 1, i32 2, i32 0, !143}
!146 = !{i32 3, %"class.Texture2D<vector<float, 4> >"* undef, !"PositionBuffer", i32 0, i32 3, i32 1, i32 2, i32 0, !143}
!147 = !{i32 4, %"class.Texture2D<vector<float, 4> >"* undef, !"NormalBuffer", i32 0, i32 4, i32 1, i32 2, i32 0, !143}
!148 = !{i32 5, %"class.Texture2D<vector<float, 4> >"* undef, !"PrevPositionBuffer", i32 0, i32 5, i32 1, i32 2, i32 0, !143}
!149 = !{i32 6, %"class.Texture2D<vector<float, 4> >"* undef, !"PrevNormalBuffer", i32 0, i32 6, i32 1, i32 2, i32 0, !143}
!150 = !{i32 7, %"class.Texture2D<float>"* undef, !"HistoryM1Prev", i32 0, i32 7, i32 1, i32 2, i32 0, !143}
!151 = !{i32 8, %"class.Texture2D<float>"* undef, !"HistoryM2Prev", i32 0, i32 8, i32 1, i32 2, i32 0, !143}
!152 = !{!153, !154, !155}
!153 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* undef, !"ResultTexture", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !143}
!154 = !{i32 1, %"class.RWTexture2D<float>"* undef, !"HistoryM1Out", i32 0, i32 1, i32 1, i32 2, i1 false, i1 false, i1 false, !143}
!155 = !{i32 2, %"class.RWTexture2D<float>"* undef, !"HistoryM2Out", i32 0, i32 2, i32 1, i32 2, i1 false, i1 false, i1 false, !143}
!156 = !{!157}
!157 = !{i32 0, %hostlayout.ConstantData* undef, !"ConstantData", i32 0, i32 0, i32 1, i32 372, null}
!158 = !{!159, !160}
!159 = !{i32 0, %struct.SamplerState* undef, !"linearClamp", i32 0, i32 0, i32 1, i32 0, null}
!160 = !{i32 1, %struct.SamplerState* undef, !"pointClamp", i32 0, i32 1, i32 1, i32 0, null}
!161 = !{i32 0, %hostlayout.struct.ConstantBufferData undef, !162, %hostlayout.ConstantData undef, !176}
!162 = !{i32 372, !163, !164, !165, !167, !168, !169, !170, !171, !172, !173, !174, !175}
!163 = !{i32 6, !"cameraPos", i32 3, i32 0, i32 7, i32 9}
!164 = !{i32 6, !"_padding0", i32 3, i32 12, i32 7, i32 9}
!165 = !{i32 6, !"invViewProjMtx", i32 2, !166, i32 3, i32 16, i32 7, i32 9}
!166 = !{i32 4, i32 4, i32 2}
!167 = !{i32 6, !"prevCameraPos", i32 3, i32 80, i32 7, i32 9}
!168 = !{i32 6, !"_padding1", i32 3, i32 92, i32 7, i32 9}
!169 = !{i32 6, !"prevInvViewProjMtx", i32 2, !166, i32 3, i32 96, i32 7, i32 9}
!170 = !{i32 6, !"viewMtx", i32 2, !166, i32 3, i32 160, i32 7, i32 9}
!171 = !{i32 6, !"viewProjMtx", i32 2, !166, i32 3, i32 224, i32 7, i32 9}
!172 = !{i32 6, !"prevViewProjMtx", i32 2, !166, i32 3, i32 288, i32 7, i32 9}
!173 = !{i32 6, !"resolution", i32 3, i32 352, i32 7, i32 9}
!174 = !{i32 6, !"time", i32 3, i32 364, i32 7, i32 9}
!175 = !{i32 6, !"frame", i32 3, i32 368, i32 7, i32 9}
!176 = !{i32 372, !177}
!177 = !{i32 6, !"ConstantData", i32 3, i32 0}
!178 = !{i32 1, void ()* @main, !179}
!179 = !{!180}
!180 = !{i32 0, !2, !2}
!181 = !{void ()* @main, !"main", null, !140, !182}
!182 = !{i32 0, i64 1, i32 4, !183}
!183 = !{i32 32, i32 32, i32 1}
!184 = !DILocation(line: 60, column: 28, scope: !185)
!185 = distinct !DILexicalBlock(scope: !186, file: !1, line: 53, column: 5)
!186 = distinct !DILexicalBlock(scope: !48, file: !1, line: 52, column: 9)
!187 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "DTid", arg: 1, scope: !48, file: !1, line: 28, type: !51)
!188 = !DIExpression(DW_OP_bit_piece, 0, 32)
!189 = !DILocation(line: 28, column: 18, scope: !48)
!190 = !DIExpression(DW_OP_bit_piece, 32, 32)
!191 = !DILocation(line: 30, column: 11, scope: !48)
!192 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "px", scope: !48, file: !1, line: 30, type: !193)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 30, baseType: !194)
!194 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 30, size: 64, align: 32, elements: !195, templateParams: !198)
!195 = !{!196, !197}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !194, file: !1, line: 30, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !194, file: !1, line: 30, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!198 = !{!58, !14}
!199 = !DILocation(line: 31, column: 22, scope: !200)
!200 = distinct !DILexicalBlock(scope: !48, file: !1, line: 31, column: 9)
!201 = !DILocation(line: 31, column: 14, scope: !200)
!202 = !DILocation(line: 31, column: 49, scope: !200)
!203 = !DILocation(line: 31, column: 65, scope: !200)
!204 = !DILocation(line: 31, column: 57, scope: !200)
!205 = !DILocation(line: 31, column: 9, scope: !48)
!206 = !DILocation(line: 32, column: 9, scope: !200)
!207 = !DILocation(line: 34, column: 28, scope: !48)
!208 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "positionAndId", scope: !48, file: !1, line: 34, type: !31)
!209 = !DIExpression()
!210 = !DILocation(line: 34, column: 12, scope: !48)
!211 = !DILocation(line: 35, column: 35, scope: !48)
!212 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "currentFrameAndDepth", scope: !48, file: !1, line: 35, type: !31)
!213 = !DILocation(line: 35, column: 12, scope: !48)
!214 = !DILocation(line: 37, column: 18, scope: !48)
!215 = !DILocation(line: 37, column: 29, scope: !48)
!216 = !DILocation(line: 37, column: 38, scope: !48)
!217 = !DILocation(line: 37, column: 36, scope: !48)
!218 = !DILocation(line: 37, column: 12, scope: !48)
!219 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uv", scope: !48, file: !1, line: 37, type: !6)
!220 = !DILocation(line: 38, column: 12, scope: !48)
!221 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ccurr", scope: !48, file: !1, line: 38, type: !40)
!222 = !DIExpression(DW_OP_bit_piece, 64, 32)
!223 = !DILocation(line: 39, column: 30, scope: !48)
!224 = !DILocation(line: 39, column: 20, scope: !48)
!225 = !DILocation(line: 39, column: 12, scope: !48)
!226 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncurr", scope: !48, file: !1, line: 39, type: !40)
!227 = !DILocation(line: 40, column: 12, scope: !48)
!228 = !DILocation(line: 41, column: 24, scope: !48)
!229 = !DILocation(line: 41, column: 10, scope: !48)
!230 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idcurr", scope: !48, file: !1, line: 41, type: !4)
!231 = !DILocation(line: 42, column: 11, scope: !48)
!232 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zcurr", scope: !48, file: !1, line: 42, type: !10)
!233 = !DILocation(line: 43, column: 18, scope: !48)
!234 = !DILocation(line: 43, column: 12, scope: !48)
!235 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vel", scope: !48, file: !1, line: 43, type: !6)
!236 = !DILocation(line: 44, column: 24, scope: !48)
!237 = !DILocation(line: 44, column: 12, scope: !48)
!238 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uvPrev", scope: !48, file: !1, line: 44, type: !6)
!239 = !DILocation(line: 46, column: 29, scope: !48)
!240 = !DILocation(line: 46, column: 18, scope: !48)
!241 = !DILocation(line: 46, column: 36, scope: !48)
!242 = !DILocation(line: 46, column: 50, scope: !48)
!243 = !DILocation(line: 46, column: 39, scope: !48)
!244 = !DILocation(line: 46, column: 58, scope: !48)
!245 = !DILocation(line: 46, column: 68, scope: !48)
!246 = !DILocation(line: 46, column: 10, scope: !48)
!247 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "valid", scope: !48, file: !1, line: 46, type: !248)
!248 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!249 = !DILocation(line: 48, column: 12, scope: !48)
!250 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cprev", scope: !48, file: !1, line: 48, type: !40)
!251 = !DILocation(line: 49, column: 11, scope: !48)
!252 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m1prev", scope: !48, file: !1, line: 49, type: !10)
!253 = !DILocation(line: 50, column: 11, scope: !48)
!254 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m2prev", scope: !48, file: !1, line: 50, type: !10)
!255 = !DILocation(line: 52, column: 9, scope: !186)
!256 = !DILocation(line: 52, column: 9, scope: !48)
