#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: db2b68355ae6fecd09f694b56fefe90a.pdb
; shader hash: db2b68355ae6fecd09f694b56fefe90a
;
; Pipeline Runtime Information: 
;
; Compute Shader
; NumThreads=(32,32,1)
;
;
; Buffer Definitions:
;
; cbuffer $Globals
; {
;
;   struct $Globals
;   {
;
;       float3 Resolution;                            ; Offset:    0
;   
;   } $Globals;                                       ; Offset:    0 Size:    12
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; $Globals                          cbuffer      NA          NA     CB0            cb0     1
; CurrentFrame                      texture     f32          2d      T0             t0     1
; VelocityBuffer                    texture     f32          2d      T1             t1     1
; HistoryBuffer                     texture     f32          2d      T2             t2     1
; ResultTexture                         UAV     f32          2d      U0             u0     1
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.7.2308.16 (52da17e29)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !53, globals: !72)
!1 = !DIFile(filename: "shaders\5CTemporalAACS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !22, !29, !38}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 71, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 71, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 71, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 71, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 81, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 81, size: 64, align: 32, elements: !16, templateParams: !20)
!16 = !{!17, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 81, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 81, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!21, !12}
!21 = !DITemplateTypeParameter(name: "element", type: !18)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 81, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 81, size: 64, align: 32, elements: !24, templateParams: !27)
!24 = !{!25, !26}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 81, baseType: !13, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 81, baseType: !13, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !{!28, !12}
!28 = !DITemplateTypeParameter(name: "element", type: !13)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 69, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 69, size: 128, align: 32, elements: !31, templateParams: !36)
!31 = !{!32, !33, !34, !35}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !30, file: !1, line: 69, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !30, file: !1, line: 69, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !30, file: !1, line: 69, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !30, file: !1, line: 69, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!36 = !{!11, !37}
!37 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 37, baseType: !39)
!39 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 37, size: 288, align: 32, elements: !40, templateParams: !50)
!40 = !{!41, !42, !43, !44, !45, !46, !47, !48, !49}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !39, file: !1, line: 37, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !39, file: !1, line: 37, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !39, file: !1, line: 37, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !39, file: !1, line: 37, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !39, file: !1, line: 37, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !39, file: !1, line: 37, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !39, file: !1, line: 37, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !39, file: !1, line: 37, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !39, file: !1, line: 37, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!50 = !{!11, !51, !52}
!51 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 3)
!52 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 3)
!53 = !{!54, !65, !68, !71}
!54 = !DISubprogram(name: "main", scope: !1, file: !1, line: 67, type: !55, isLocal: false, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!55 = !DISubroutineType(types: !56)
!56 = !{null, !57}
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 5, baseType: !58)
!58 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 5, size: 96, align: 32, elements: !59, templateParams: !63)
!59 = !{!60, !61, !62}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !58, file: !1, line: 5, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !58, file: !1, line: 5, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !58, file: !1, line: 5, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!63 = !{!21, !64}
!64 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!65 = !DISubprogram(name: "RGBAToYCoCg", linkageName: "\01?RGBAToYCoCg@@YA?AV?$vector@M$03@@V1@@Z", scope: !1, file: !1, line: 34, type: !66, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false)
!66 = !DISubroutineType(types: !67)
!67 = !{!29, !29}
!68 = !DISubprogram(name: "GetCurrentFrame", linkageName: "\01?GetCurrentFrame@@YA?AV?$vector@M$03@@V?$vector@I$01@@@Z", scope: !1, file: !1, line: 61, type: !69, isLocal: false, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: false)
!69 = !DISubroutineType(types: !70)
!70 = !{!29, !14}
!71 = !DISubprogram(name: "YCoCgToRGBA", linkageName: "\01?YCoCgToRGBA@@YA?AV?$vector@M$03@@V1@@Z", scope: !1, file: !1, line: 48, type: !66, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: false)
!72 = !{!73, !73, !82, !86, !87, !88}
!73 = !DIGlobalVariable(name: "Resolution", linkageName: "\01?Resolution@@3V?$vector@M$02@@B", scope: !0, file: !1, line: 5, type: !74, isLocal: false, isDefinition: true)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 5, baseType: !76)
!76 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 5, size: 96, align: 32, elements: !77, templateParams: !81)
!77 = !{!78, !79, !80}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !76, file: !1, line: 5, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !76, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !76, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!81 = !{!11, !64}
!82 = !DIGlobalVariable(name: "CurrentFrame", linkageName: "\01?CurrentFrame@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 1, type: !83, isLocal: false, isDefinition: true)
!83 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 1, size: 160, align: 32, elements: !2, templateParams: !84)
!84 = !{!85}
!85 = !DITemplateTypeParameter(name: "element", type: !30)
!86 = !DIGlobalVariable(name: "VelocityBuffer", linkageName: "\01?VelocityBuffer@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 2, type: !83, isLocal: false, isDefinition: true)
!87 = !DIGlobalVariable(name: "HistoryBuffer", linkageName: "\01?HistoryBuffer@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 3, type: !83, isLocal: false, isDefinition: true)
!88 = !DIGlobalVariable(name: "ResultTexture", linkageName: "\01?ResultTexture@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 4, type: !89, isLocal: false, isDefinition: true)
!89 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 4, size: 128, align: 32, elements: !2, templateParams: !84)
!90 = !{i32 2, !"Dwarf Version", i32 4}
!91 = !{i32 2, !"Debug Info Version", i32 3}
!92 = !{!"dxcoob 1.7.2308.16 (52da17e29)"}
