#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: df7785e88c5341e2844a1ebb247e100f.pdb
; shader hash: df7785e88c5341e2844a1ebb247e100f
;
; Pipeline Runtime Information: 
;
; Compute Shader
; NumThreads=(32,32,1)
;
;
; Buffer Definitions:
;
; cbuffer $Globals
; {
;
;   struct $Globals
;   {
;
;       float3 Resolution;                            ; Offset:    0
;   
;   } $Globals;                                       ; Offset:    0 Size:    12
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; $Globals                          cbuffer      NA          NA     CB0            cb0     1
; CurrentFrame                      texture     f32          2d      T0             t0     1
; VelocityBuffer                    texture     f32          2d      T1             t1     1
; HistoryBuffer                     texture     f32          2d      T2             t2     1
; ResultTexture                         UAV     f32          2d      U0             u0     1
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.7.2308.16 (52da17e29)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !45, globals: !66)
!1 = !DIFile(filename: "shaders\5CTemporalAACS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !21, !30}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 75, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 75, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 75, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 75, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 85, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 85, size: 64, align: 32, elements: !16, templateParams: !19)
!16 = !{!17, !18}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 85, baseType: !13, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 85, baseType: !13, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !{!20, !12}
!20 = !DITemplateTypeParameter(name: "element", type: !13)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 73, baseType: !22)
!22 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 73, size: 128, align: 32, elements: !23, templateParams: !28)
!23 = !{!24, !25, !26, !27}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !22, file: !1, line: 73, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !22, file: !1, line: 73, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !22, file: !1, line: 73, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !22, file: !1, line: 73, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!28 = !{!11, !29}
!29 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 40, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 40, size: 288, align: 32, elements: !32, templateParams: !42)
!32 = !{!33, !34, !35, !36, !37, !38, !39, !40, !41}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !31, file: !1, line: 40, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !31, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !31, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !31, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !31, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !31, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !31, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !31, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !31, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!42 = !{!11, !43, !44}
!43 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 3)
!44 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 3)
!45 = !{!46, !59, !62, !65}
!46 = !DISubprogram(name: "main", scope: !1, file: !1, line: 71, type: !47, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!47 = !DISubroutineType(types: !48)
!48 = !{null, !49}
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 8, baseType: !50)
!50 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 8, size: 96, align: 32, elements: !51, templateParams: !56)
!51 = !{!52, !54, !55}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !50, file: !1, line: 8, baseType: !53, size: 32, align: 32, flags: DIFlagPublic)
!53 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !50, file: !1, line: 8, baseType: !53, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !50, file: !1, line: 8, baseType: !53, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!56 = !{!57, !58}
!57 = !DITemplateTypeParameter(name: "element", type: !53)
!58 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!59 = !DISubprogram(name: "RGBAToYCoCg", linkageName: "\01?RGBAToYCoCg@@YA?AV?$vector@M$03@@V1@@Z", scope: !1, file: !1, line: 37, type: !60, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false)
!60 = !DISubroutineType(types: !61)
!61 = !{!21, !21}
!62 = !DISubprogram(name: "GetCurrentFrame", linkageName: "\01?GetCurrentFrame@@YA?AV?$vector@M$03@@V?$vector@H$01@@@Z", scope: !1, file: !1, line: 64, type: !63, isLocal: false, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: false)
!63 = !DISubroutineType(types: !64)
!64 = !{!21, !14}
!65 = !DISubprogram(name: "YCoCgToRGBA", linkageName: "\01?YCoCgToRGBA@@YA?AV?$vector@M$03@@V1@@Z", scope: !1, file: !1, line: 51, type: !60, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: false)
!66 = !{!67, !67, !76, !80, !81, !82, !85, !86}
!67 = !DIGlobalVariable(name: "Resolution", linkageName: "\01?Resolution@@3V?$vector@M$02@@B", scope: !0, file: !1, line: 8, type: !68, isLocal: false, isDefinition: true)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 8, baseType: !70)
!70 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 8, size: 96, align: 32, elements: !71, templateParams: !75)
!71 = !{!72, !73, !74}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !70, file: !1, line: 8, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !70, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !70, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!75 = !{!11, !58}
!76 = !DIGlobalVariable(name: "CurrentFrame", linkageName: "\01?CurrentFrame@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 1, type: !77, isLocal: false, isDefinition: true)
!77 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 1, size: 160, align: 32, elements: !2, templateParams: !78)
!78 = !{!79}
!79 = !DITemplateTypeParameter(name: "element", type: !22)
!80 = !DIGlobalVariable(name: "VelocityBuffer", linkageName: "\01?VelocityBuffer@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 2, type: !77, isLocal: false, isDefinition: true)
!81 = !DIGlobalVariable(name: "HistoryBuffer", linkageName: "\01?HistoryBuffer@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 3, type: !77, isLocal: false, isDefinition: true)
!82 = !DIGlobalVariable(name: "DepthBuffer", linkageName: "\01?DepthBuffer@@3V?$Texture2D@M@@A", scope: !0, file: !1, line: 4, type: !83, isLocal: false, isDefinition: true)
!83 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<float>", file: !1, line: 4, size: 64, align: 32, elements: !2, templateParams: !84)
!84 = !{!11}
!85 = !DIGlobalVariable(name: "PrevDepthBuffer", linkageName: "\01?PrevDepthBuffer@@3V?$Texture2D@M@@A", scope: !0, file: !1, line: 5, type: !83, isLocal: false, isDefinition: true)
!86 = !DIGlobalVariable(name: "ResultTexture", linkageName: "\01?ResultTexture@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 7, type: !87, isLocal: false, isDefinition: true)
!87 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 7, size: 128, align: 32, elements: !2, templateParams: !78)
!88 = !{i32 2, !"Dwarf Version", i32 4}
!89 = !{i32 2, !"Debug Info Version", i32 3}
!90 = !{!"dxcoob 1.7.2308.16 (52da17e29)"}
